giovannimasi/MATLAB_Simulink_tirocinio_2025/Examples/R2024b/c2b/DualMotorDynoUsingC2000ProcessorsExample(old)/mcb_pmsm_foc_sensorless_dyno_f28379d_ert_rtw/mcb_pmsm_foc_sensorless_dyno_f28379d.h
/*
 * Academic License - for use in teaching, academic research, and meeting
 * course requirements at degree granting institutions only.  Not for
 * government, commercial, or other organizational use.
 *
 * File: mcb_pmsm_foc_sensorless_dyno_f28379d.h
 *
 * Code generated for Simulink model 'mcb_pmsm_foc_sensorless_dyno_f28379d'.
 *
 * Model version                  : 9.12
 * Simulink Coder version         : 24.2 (R2024b) 21-Jun-2024
 * C/C++ source code generated on : Tue May 27 11:59:56 2025
 *
 * Target selection: ert.tlc
 * Embedded hardware selection: Texas Instruments->C2000
 * Code generation objectives: Unspecified
 * Validation result: Not run
 */

#ifndef mcb_pmsm_foc_sensorless_dyno_f28379d_h_
#define mcb_pmsm_foc_sensorless_dyno_f28379d_h_
#ifndef mcb_pmsm_foc_sensorless_dyno_f28379d_COMMON_INCLUDES_
#define mcb_pmsm_foc_sensorless_dyno_f28379d_COMMON_INCLUDES_
#include "rtwtypes.h"
#include "string.h"
#include "c2000BoardSupport.h"
#include "MW_f2837xD_includes.h"
#include "DSP28xx_SciUtil.h"
#include "IQmathLib.h"
#include "MW_SPI.h"
#endif               /* mcb_pmsm_foc_sensorless_dyno_f28379d_COMMON_INCLUDES_ */

#include "MW_c2000ISR.h"
#include "mcb_pmsm_foc_sensorless_dyno_f28379d_types.h"
#include "rt_nonfinite.h"
#include "rtGetNaN.h"
#include <string.h>
#include <stddef.h>
#include "zero_crossing_types.h"
#include "MW_target_hardware_resources.h"

/* Macros for accessing real-time model data structure */
#ifndef rtmGetErrorStatus
#define rtmGetErrorStatus(rtm)         ((rtm)->errorStatus)
#endif

#ifndef rtmSetErrorStatus
#define rtmSetErrorStatus(rtm, val)    ((rtm)->errorStatus = (val))
#endif

#ifndef rtmStepTask
#define rtmStepTask(rtm, idx)          ((rtm)->Timing.TaskCounters.TID[(idx)] == 0)
#endif

#ifndef rtmTaskCounter
#define rtmTaskCounter(rtm, idx)       ((rtm)->Timing.TaskCounters.TID[(idx)])
#endif

#define mcb_pmsm_foc_sensorless_dyno_f28379d_M (mcb_pmsm_foc_sensorless_dyno_M)

extern void init_SCI(void);
extern void init_SCI_GPIO(void);
extern void config_ePWMSyncSource(void);
extern void config_ePWM_GPIO (void);
extern void config_ePWM_TBSync (void);
extern void config_ePWM_XBAR(void);

/* user code (top of header file) */
#include "F2837xD_Ipc_drivers.h"

/* Block signals for system '<S34>/Two phase CRL wrap' */
typedef struct {
  real32_T a_plus_2b;                  /* '<S35>/a_plus_2b' */
  real32_T one_by_sqrt3;               /* '<S35>/one_by_sqrt3' */
  real32_T algDD_o1;
  real32_T algDD_o2;
} rtB_TwophaseCRLwrap_mcb_pmsm_fo;

/* Block signals for system '<S36>/D//Q Axis Priority' */
typedef struct {
  real32_T Switch[2];                  /* '<S40>/Switch' */
  real32_T Switch2;                    /* '<S50>/Switch2' */
  real32_T Product;                    /* '<S49>/Product' */
  real32_T Sum;                        /* '<S49>/Sum' */
  real32_T Product2;                   /* '<S49>/Product2' */
  real32_T Merge;                      /* '<S49>/Merge' */
  real32_T Gain;                       /* '<S49>/Gain' */
  real32_T Switch_a;                   /* '<S50>/Switch' */
  real32_T Switch1;                    /* '<S51>/Switch1' */
  real32_T Sqrt;                       /* '<S51>/Sqrt' */
  real32_T Gain_l;                     /* '<S51>/Gain' */
  uint16_T DataTypeConversion;         /* '<S49>/Data Type Conversion' */
  boolean_T Compare;                   /* '<S45>/Compare' */
  boolean_T Compare_k;                 /* '<S46>/Compare' */
  boolean_T LowerRelop1;               /* '<S50>/LowerRelop1' */
  boolean_T RelationalOperator;        /* '<S49>/Relational Operator' */
  boolean_T UpperRelop;                /* '<S50>/UpperRelop' */
} rtB_DQAxisPriority_mcb_pmsm_foc;

/* Block signals for system '<S36>/D-Q Equivalence' */
typedef struct {
  real32_T Product[2];                 /* '<S43>/Product' */
  real32_T SquareRoot;                 /* '<S43>/Square Root' */
  real32_T Switch;                     /* '<S43>/Switch' */
  uint16_T DataTypeConversion;         /* '<S39>/Data Type Conversion' */
  boolean_T RelationalOperator;        /* '<S39>/Relational Operator' */
} rtB_DQEquivalence_mcb_pmsm_foc_;

/* Block signals for system '<S29>/Two inputs CRL' */
typedef struct {
  real32_T qcos;                       /* '<S165>/qcos' */
  real32_T dsin;                       /* '<S165>/dsin' */
  real32_T sum_beta;                   /* '<S165>/sum_beta' */
  real32_T dcos;                       /* '<S165>/dcos' */
  real32_T qsin;                       /* '<S165>/qsin' */
  real32_T sum_alpha;                  /* '<S165>/sum_alpha' */
  real32_T Switch[2];                  /* '<S166>/Switch' */
  real32_T algDD_o1;
  real32_T algDD_o2;
} rtB_TwoinputsCRL_mcb_pmsm_foc_s;

/* Block signals for system '<S31>/Two inputs CRL' */
typedef struct {
  real32_T acos_k;                     /* '<S170>/acos' */
  real32_T bsin;                       /* '<S170>/bsin' */
  real32_T sum_Ds;                     /* '<S170>/sum_Ds' */
  real32_T bcos;                       /* '<S170>/bcos' */
  real32_T asin_m;                     /* '<S170>/asin' */
  real32_T sum_Qs;                     /* '<S170>/sum_Qs' */
  real32_T Switch[2];                  /* '<S171>/Switch' */
  real32_T algDD_o1;
  real32_T algDD_o2;
} rtB_TwoinputsCRL_mcb_pmsm_foc_k;

/* Block signals for system '<S174>/If Action Subsystem' */
typedef struct {
  real32_T Convert_back;               /* '<S177>/Convert_back' */
  int16_T Convert_uint16;              /* '<S177>/Convert_uint16' */
} rtB_IfActionSubsystem_mcb_pmsm_;

/* Block signals for system '<S174>/If Action Subsystem1' */
typedef struct {
  real32_T Convert_back;               /* '<S178>/Convert_back' */
  int16_T Convert_uint16;              /* '<S178>/Convert_uint16' */
} rtB_IfActionSubsystem1_mcb_pmsm;

/* Block signals for system '<S234>/Dir_Sense' */
typedef struct {
  int16_T Switch;                      /* '<S242>/Switch' */
  boolean_T LogicalOperator;           /* '<S242>/Logical Operator' */
} rtB_Dir_Sense_mcb_pmsm_foc_sens;

/* Zero-crossing (trigger) state for system '<S234>/Dir_Sense' */
typedef struct {
  ZCSigState Dir_Sense_Trig_ZCE;       /* '<S234>/Dir_Sense' */
} rtZCE_Dir_Sense_mcb_pmsm_foc_se;

/* Block signals for system '<S233>/angleCompensation' */
typedef struct {
  real32_T Product;                    /* '<S241>/Product' */
  real32_T Product2;                   /* '<S241>/Product2' */
  real32_T Sum1;                       /* '<S241>/Sum1' */
  real32_T Product1;                   /* '<S241>/Product1' */
  real32_T Product3;                   /* '<S241>/Product3' */
  real32_T Sum2;                       /* '<S241>/Sum2' */
  real32_T Switch;                     /* '<S241>/Switch' */
  real32_T Atan2;                      /* '<S258>/Atan2' */
  real32_T Switch_e;                   /* '<S258>/Switch' */
  real32_T algDD;
  real32_T Gain;                       /* '<S259>/Gain' */
  real32_T Switch_p;                   /* '<S259>/Switch' */
  real32_T Bias;                       /* '<S259>/Bias' */
  real32_T Bias_a;                     /* '<S241>/Bias' */
} rtB_angleCompensation_mcb_pmsm_;

