giovannimasi/MATLAB_Simulink_tirocinio_2025/Examples/R2024b/c2b/DualMotorDynoUsingC2000ProcessorsExample(old)/mcb_pmsm_foc_sensorless_dyno_f28379d_ert_rtw/mcb_pmsm_foc_sensorless_dyno_f28379d.h
/* Block signals for system '<S189>/Flux Observer' */
typedef struct {
  uint32_T PositionToCount;            /* '<S197>/PositionToCount' */
  uint32_T Delay;                      /* '<S197>/Delay' */
  real32_T Switch1[2];                 /* '<S198>/Switch1' */
  real32_T Product[4];                 /* '<S201>/Product' */
  real32_T UnitDelay[4];               /* '<S201>/Unit Delay' */
  real32_T Product1[4];                /* '<S201>/Product1' */
  real32_T Add1[4];                    /* '<S201>/Add1' */
  real32_T Sum6[4];                    /* '<S194>/Sum6' */
  real32_T Product_c;                  /* '<S224>/Product' */
  real32_T Sum3;                       /* '<S221>/Sum3' */
  real32_T Delay1;                     /* '<S223>/Delay1' */
  real32_T Sum;                        /* '<S223>/Sum' */
  real32_T Product_f;                  /* '<S223>/Product' */
  real32_T Delay_k;                    /* '<S223>/Delay' */
  real32_T Product1_b;                 /* '<S223>/Product1' */
  real32_T Sum1;                       /* '<S223>/Sum1' */
  real32_T Product2;                   /* '<S224>/Product2' */
  real32_T Sum1_c;                     /* '<S221>/Sum1' */
  real32_T Sum_i;                      /* '<S222>/Sum' */
  real32_T Switch1_k[2];               /* '<S222>/Switch1' */
  real32_T Product_m;                  /* '<S227>/Product' */
  real32_T UnitDelay_c;                /* '<S227>/Unit Delay' */
  real32_T Product1_n;                 /* '<S227>/Product1' */
  real32_T Add1_p;                     /* '<S227>/Add1' */
  real32_T Switch;                     /* '<S220>/Switch' */
  real32_T Product_n;                  /* '<S216>/Product' */
  real32_T Sum3_a;                     /* '<S213>/Sum3' */
  real32_T Delay1_a;                   /* '<S215>/Delay1' */
  real32_T Sum_e;                      /* '<S215>/Sum' */
  real32_T Product_e;                  /* '<S215>/Product' */
  real32_T Delay_f;                    /* '<S215>/Delay' */
  real32_T Product1_i;                 /* '<S215>/Product1' */
  real32_T Sum1_cf;                    /* '<S215>/Sum1' */
  real32_T Product2_e;                 /* '<S216>/Product2' */
  real32_T Sum1_n;                     /* '<S213>/Sum1' */
  real32_T Sum_iu;                     /* '<S214>/Sum' */
  real32_T Switch1_p[2];               /* '<S214>/Switch1' */
  real32_T Product_nb;                 /* '<S219>/Product' */
  real32_T UnitDelay_a;                /* '<S219>/Unit Delay' */
  real32_T Product1_a;                 /* '<S219>/Product1' */
  real32_T Add1_l;                     /* '<S219>/Add1' */
  real32_T Switch_h;                   /* '<S212>/Switch' */
  real32_T DTC;                        /* '<S232>/DTC' */
  real32_T SpeedGain;                  /* '<S197>/SpeedGain' */
  real32_T Switch1_c[2];               /* '<S196>/Switch1' */
  real32_T Product_d;                  /* '<S230>/Product' */
  real32_T UnitDelay_m;                /* '<S230>/Unit Delay' */
  real32_T Product1_d;                 /* '<S230>/Product1' */
  real32_T Add1_h;                     /* '<S230>/Add1' */
  real32_T elect2mech;                 /* '<S192>/elect2mech' */
  real32_T Sum_j;                      /* '<S226>/Sum' */
  real32_T Sum_c;                      /* '<S218>/Sum' */
  real32_T Atan2;                      /* '<S210>/Atan2' */
  real32_T Switch_b;                   /* '<S210>/Switch' */
  real32_T algDD;
  real32_T Gain;                       /* '<S211>/Gain' */
  real32_T Switch_a;                   /* '<S211>/Switch' */
  real32_T Bias;                       /* '<S211>/Bias' */
  int32_T SpeedCount;                  /* '<S197>/SpeedCount' */
  boolean_T DataStoreRead1;            /* '<S192>/Data Store Read1' */
  boolean_T LogicalOperator;           /* '<S192>/Logical Operator' */
} rtB_FluxObserver_mcb_pmsm_foc_s;

/* Block states (default storage) for system '<S189>/Flux Observer' */
typedef struct {
  real32_T UnitDelay_DSTATE[4];        /* '<S201>/Unit Delay' */
  real32_T Delay1_DSTATE;              /* '<S223>/Delay1' */
  real32_T Delay_DSTATE;               /* '<S223>/Delay' */
  real32_T UnitDelay_DSTATE_b;         /* '<S227>/Unit Delay' */
  real32_T Delay1_DSTATE_c;            /* '<S215>/Delay1' */
  real32_T Delay_DSTATE_c;             /* '<S215>/Delay' */
  real32_T UnitDelay_DSTATE_c;         /* '<S219>/Unit Delay' */
  real32_T UnitDelay_DSTATE_f;         /* '<S230>/Unit Delay' */
  uint32_T Delay_DSTATE_l[10];         /* '<S197>/Delay' */
  int32_T SpeedCount_DWORK1;           /* '<S197>/SpeedCount' */
  uint16_T CircBufIdx;                 /* '<S197>/Delay' */
} rtDW_FluxObserver_mcb_pmsm_foc_;

/* Zero-crossing (trigger) state for system '<S189>/Flux Observer' */
typedef struct {
  ZCSigState Delay1_Reset_ZCE;         /* '<S223>/Delay1' */
  ZCSigState Delay_Reset_ZCE;          /* '<S223>/Delay' */
  ZCSigState Delay1_Reset_ZCE_b;       /* '<S215>/Delay1' */
  ZCSigState Delay_Reset_ZCE_g;        /* '<S215>/Delay' */
} rtZCE_FluxObserver_mcb_pmsm_foc;

/* Block signals for system '<S469>/If Action Subsystem' */
typedef struct {
  uint16_T Memory;                     /* '<S474>/Memory' */
  uint16_T Sum;                        /* '<S474>/Sum' */
  uint16_T Memory1;                    /* '<S474>/Memory1' */
  uint16_T Sum1;                       /* '<S474>/Sum1' */
} rtB_IfActionSubsystem_mcb_pms_h;

/* Block states (default storage) for system '<S469>/If Action Subsystem' */
typedef struct {
  uint16_T Memory_PreviousInput;       /* '<S474>/Memory' */
  uint16_T Memory1_PreviousInput;      /* '<S474>/Memory1' */
} rtDW_IfActionSubsystem_mcb_pm_n;

/* Block signals for system '<S466>/SPI Master Transfer' */
typedef struct {
  uint16_T SPIMasterTransfer;          /* '<S466>/SPI Master Transfer' */
} rtB_SPIMasterTransfer_mcb_pmsm_;

/* Block states (default storage) for system '<S466>/SPI Master Transfer' */
typedef struct {
  codertarget_tic2000_blocks_SPIM obj; /* '<S466>/SPI Master Transfer' */
  boolean_T objisempty;                /* '<S466>/SPI Master Transfer' */
} rtDW_SPIMasterTransfer_mcb_pmsm;

