giovannimasi/MATLAB_Simulink_tirocinio_2025/Examples/R2024b/c2b/DualMotorDynoUsingC2000ProcessorsExample(old)/mcb_pmsm_foc_sensorless_dyno_f28379d_ert_rtw/mcb_pmsm_foc_sensorless_dyno_f28379d.h
/* Block signals for system '<S466>/SPI Master Transfer2' */
typedef struct {
  uint16_T SPIMasterTransfer2;         /* '<S466>/SPI Master Transfer2' */
} rtB_SPIMasterTransfer2_mcb_pmsm;

/* Block states (default storage) for system '<S466>/SPI Master Transfer2' */
typedef struct {
  codertarget_tic2000_blocks_SPIM obj; /* '<S466>/SPI Master Transfer2' */
  boolean_T objisempty;                /* '<S466>/SPI Master Transfer2' */
} rtDW_SPIMasterTransfer2_mcb_pms;

/* Block signals for system '<Root>/Speed Control' */
typedef struct {
  real32_T Id_Ref;                     /* '<S8>/Id_Ref' */
  real32_T Merge;                      /* '<S8>/Merge' */
  real32_T Speed_Ref;                  /* '<S558>/Switch' */
  real32_T Switch1[2];                 /* '<S561>/Switch1' */
  real32_T Product;                    /* '<S618>/Product' */
  real32_T UnitDelay;                  /* '<S618>/Unit Delay' */
  real32_T Product1;                   /* '<S618>/Product1' */
  real32_T Add1;                       /* '<S618>/Add1' */
  real32_T Sum;                        /* '<S555>/Sum' */
  real32_T RateLimiter;                /* '<S557>/Rate Limiter' */
  real32_T RateLimiter1;               /* '<S557>/Rate Limiter1' */
  real32_T DataStoreRead;              /* '<S558>/Data Store Read' */
  real32_T Switch1_n;                  /* '<S558>/Switch1' */
  real32_T Trq_ref;                    /* '<S555>/PI_Controller_Speed' */
  boolean_T DataStoreRead1;            /* '<S555>/Data Store Read1' */
  boolean_T DataStoreRead2;            /* '<S555>/Data Store Read2' */
  boolean_T AND;                       /* '<S555>/AND' */
  boolean_T LogicalOperator;           /* '<S555>/Logical Operator' */
  boolean_T DataStoreRead1_e;          /* '<S558>/Data Store Read1' */
} rtB_SpeedControl_mcb_pmsm_foc_s;

/* Block states (default storage) for system '<Root>/Speed Control' */
typedef struct {
  real32_T UnitDelay_DSTATE;           /* '<S618>/Unit Delay' */
  real32_T PrevY;                      /* '<S557>/Rate Limiter' */
  real32_T PrevY_a;                    /* '<S557>/Rate Limiter1' */
  real32_T integrator_state;           /* '<S555>/PI_Controller_Speed' */
} rtDW_SpeedControl_mcb_pmsm_foc_;

/* Block signals (default storage) */
typedef struct {
  real_T T_load;                       /* '<S6>/T_load' */
  real_T DiscreteTimeIntegrator;       /* '<S492>/Discrete-Time Integrator' */
  real_T Gain;                         /* '<S6>/Gain' */
  real_T DiscreteTimeIntegrator3;      /* '<S539>/Discrete-Time Integrator3' */
  real_T DiscreteTimeIntegrator3_a;    /* '<S540>/Discrete-Time Integrator3' */
  real_T Switch2;                      /* '<S6>/Switch2' */
  real_T Switch1[2];                   /* '<S484>/Switch1' */
  real_T Product;                      /* '<S489>/Product' */
  real_T UnitDelay;                    /* '<S489>/Unit Delay' */
  real_T Product1;                     /* '<S489>/Product1' */
  real_T Add1;                         /* '<S489>/Add1' */
  real_T DiscreteTimeIntegrator3_g;    /* '<S510>/Discrete-Time Integrator3' */
  real_T UnitDelay_b;                  /* '<S495>/Unit Delay' */
  real_T Switch1_g;                    /* '<S495>/Switch1' */
  real_T Gain4;                        /* '<S492>/Gain4' */
  real_T sine_cosine_o1;               /* '<S494>/sine_cosine' */
  real_T sine_cosine_o2;               /* '<S494>/sine_cosine' */
  real_T Product2;                     /* '<S505>/Product2' */
  real_T DiscreteTimeIntegrator3_b;    /* '<S511>/Discrete-Time Integrator3' */
  real_T Product3;                     /* '<S505>/Product3' */
  real_T Add1_c;                       /* '<S505>/Add1' */
  real_T Product_a;                    /* '<S506>/Product' */
  real_T Product_i;                    /* '<S509>/Product' */
  real_T Gain1;                        /* '<S506>/Gain1' */
  real_T Add;                          /* '<S506>/Add' */
  real_T Gain2;                        /* '<S506>/Gain2' */
  real_T Divide2;                      /* '<S492>/Divide2' */
  real_T Sign;                         /* '<S492>/Sign' */
  real_T Divide1;                      /* '<S492>/Divide1' */
  real_T Sum1;                         /* '<S492>/Sum1' */
  real_T Divide;                       /* '<S492>/Divide' */
  real_T Gain_o;                       /* '<S492>/Gain' */
  real_T Gain1_b;                      /* '<S495>/Gain1' */
  real_T Add_h;                        /* '<S495>/Add' */
  real_T Gain_f;                       /* '<S503>/Gain' */
  real_T Gain1_j;                      /* '<S503>/Gain1' */
  real_T Gain4_n;                      /* '<S503>/Gain4' */
  real_T Add_b;                        /* '<S503>/Add' */
  real_T Gain2_p;                      /* '<S503>/Gain2' */
  real_T Gain3;                        /* '<S503>/Gain3' */
  real_T Add1_e;                       /* '<S503>/Add1' */
  real_T Gain1_e;                      /* '<S504>/Gain1' */
  real_T Gain2_k;                      /* '<S504>/Gain2' */
  real_T Product_h;                    /* '<S505>/Product' */
  real_T Product1_k;                   /* '<S505>/Product1' */
  real_T Add_c;                        /* '<S505>/Add' */
  real_T Gain3_a;                      /* '<S504>/Gain3' */
  real_T Gain4_l;                      /* '<S504>/Gain4' */
  real_T Product2_j;                   /* '<S508>/Product2' */
  real_T Product3_o;                   /* '<S508>/Product3' */
  real_T Add1_o;                       /* '<S508>/Add1' */
  real_T Product_d;                    /* '<S512>/Product' */
  real_T Product_o;                    /* '<S510>/Product' */
  real_T Product_iz;                   /* '<S513>/Product' */
  real_T Product_hf;                   /* '<S514>/Product' */
  real_T Add_m;                        /* '<S510>/Add' */
  real_T Product_c;                    /* '<S508>/Product' */
  real_T Product1_j;                   /* '<S508>/Product1' */
  real_T Add_o;                        /* '<S508>/Add' */
  real_T Product_e;                    /* '<S515>/Product' */
  real_T Product_l;                    /* '<S511>/Product' */
  real_T Product_p;                    /* '<S516>/Product' */
  real_T Product_ig;                   /* '<S517>/Product' */
  real_T Product_pc;                   /* '<S518>/Product' */
  real_T Add_e;                        /* '<S511>/Add' */
  real_T VectorConcatenate[3];         /* '<S491>/Vector Concatenate' */
  real_T UnitDelay_bu;                 /* '<S524>/Unit Delay' */
  real_T Switch1_h;                    /* '<S524>/Switch1' */
  real_T Gain4_d;                      /* '<S521>/Gain4' */
  real_T sine_cosine_o1_m;             /* '<S523>/sine_cosine' */
  real_T sine_cosine_o2_h;             /* '<S523>/sine_cosine' */
  real_T Product2_i;                   /* '<S534>/Product2' */
  real_T Product3_g;                   /* '<S534>/Product3' */
  real_T Add1_f;                       /* '<S534>/Add1' */
  real_T Gain_b;                       /* '<S521>/Gain' */
  real_T Gain1_h;                      /* '<S524>/Gain1' */
  real_T Add_hz;                       /* '<S524>/Add' */
  real_T Switch1_h2[3];                /* '<S6>/Switch1' */
  real_T Gain_j;                       /* '<S532>/Gain' */
  real_T Gain1_o;                      /* '<S532>/Gain1' */
  real_T Gain4_la;                     /* '<S532>/Gain4' */
  real_T Add_a;                        /* '<S532>/Add' */
  real_T Gain2_i;                      /* '<S532>/Gain2' */
  real_T Gain3_f;                      /* '<S532>/Gain3' */
  real_T Add1_n;                       /* '<S532>/Add1' */
  real_T Gain1_o0;                     /* '<S533>/Gain1' */
  real_T Gain2_m;                      /* '<S533>/Gain2' */
  real_T Product_df;                   /* '<S534>/Product' */
  real_T Product1_b;                   /* '<S534>/Product1' */
  real_T Add_p;                        /* '<S534>/Add' */
  real_T Gain3_fw;                     /* '<S533>/Gain3' */
  real_T Gain4_g;                      /* '<S533>/Gain4' */
  real_T Product2_f;                   /* '<S537>/Product2' */
  real_T Product3_i;                   /* '<S537>/Product3' */
  real_T Add1_p;                       /* '<S537>/Add1' */
  real_T Product_n;                    /* '<S541>/Product' */
  real_T Product_f;                    /* '<S539>/Product' */
  real_T Product_k;                    /* '<S542>/Product' */
  real_T Product_fj;                   /* '<S543>/Product' */
  real_T Add_p3;                       /* '<S539>/Add' */
  real_T Product_fo;                   /* '<S537>/Product' */
  real_T Product1_n;                   /* '<S537>/Product1' */
  real_T Add_n;                        /* '<S537>/Add' */
  real_T Product_dy;                   /* '<S544>/Product' */
  real_T Product_ne;                   /* '<S540>/Product' */
  real_T Product_em;                   /* '<S545>/Product' */
  real_T Product_b;                    /* '<S546>/Product' */
  real_T Product_lp;                   /* '<S547>/Product' */
  real_T Add_l;                        /* '<S540>/Add' */
  real_T VectorConcatenate_i[3];       /* '<S520>/Vector Concatenate' */
  real_T Gain1_d;                      /* '<S535>/Gain1' */
  real_T Product_g;                    /* '<S535>/Product' */
  real_T Product_m;                    /* '<S538>/Product' */
  real_T Add_g;                        /* '<S535>/Add' */
  real_T Gain2_c;                      /* '<S535>/Gain2' */
  real_T Add1_oo;                      /* '<S524>/Add1' */
  real_T Switch;                       /* '<S524>/Switch' */
  real_T Subtract;                     /* '<S524>/Subtract' */
  real_T Add1_j;                       /* '<S495>/Add1' */
  real_T Switch_e;                     /* '<S495>/Switch' */
  real_T Subtract_g;                   /* '<S495>/Subtract' */
  uint32_T Sum[4];                     /* '<S366>/Sum' */
  uint32_T PositionToCount;            /* '<S438>/PositionToCount' */
  uint32_T Delay;                      /* '<S438>/Delay' */
  uint32_T Sum_o[4];                   /* '<S172>/Sum' */
  uint32_T BytePack[2];                /* '<S266>/Byte Pack' */
  uint32_T SCI_Tx_Data[3];             /* '<S264>/Merge' */
  uint32_T SCI_Tx_Iteration;           /* '<S264>/Merge1' */
  uint32_T IndexVector;                /* '<S265>/Index Vector' */
  uint32_T Add_ci;                     /* '<S265>/Add' */
  uint32_T Data[2];                    /* '<S268>/Data' */
  uint32_T Data_f[2];                  /* '<S269>/Data' */
  uint32_T Data_fw[2];                 /* '<S270>/Data' */
  uint32_T PositionToCount_i;          /* '<S240>/PositionToCount' */
  uint32_T Delay_n;                    /* '<S240>/Delay' */
  real32_T RT_f;                       /* '<Root>/RT' */
  real32_T RT3;                        /* '<Root>/RT3' */
  real32_T RateTransition3;            /* '<Root>/Rate Transition3' */
  real32_T RT2[2];                     /* '<Root>/RT2' */
  real32_T mtr2_VI_debug[6];           /* '<Root>/RT8' */
  real32_T mtr2_Te_PU;                 /* '<Root>/RT8' */
  real32_T mtr2_Pm_PU;                 /* '<Root>/RT8' */
  real32_T mtr2_Speed_PU;              /* '<Root>/RT8' */
  real32_T mtr2_Iab_meas_PU[2];        /* '<Root>/RT8' */
  real32_T mtr2_Pos_PU;                /* '<Root>/RT8' */
  real32_T RT6[2];                     /* '<Root>/RT6' */
  real32_T Switch1_b[2];               /* '<S619>/Switch1' */
  real32_T Product_i1[2];              /* '<S622>/Product' */
  real32_T UnitDelay_f[2];             /* '<S622>/Unit Delay' */
  real32_T Product1_g[2];              /* '<S622>/Product1' */
  real32_T Add1_i[2];                  /* '<S622>/Add1' */
  real32_T DataTypeConversion;         /* '<S6>/Data Type Conversion' */
  real32_T SCIReceive[3];              /* '<S554>/SCI Receive' */
  real32_T OutportBufferForDesriedIqref;/* '<S7>/Parse SCI Rx' */
  real32_T GetADCVoltage[2];           /* '<S389>/Get ADC Voltage' */
  real32_T GetCurrents[2];             /* '<S389>/Get Currents' */
  real32_T PU_Conversion[2];           /* '<S389>/PU_Conversion' */
  real32_T Delay_j[4];                 /* '<S3>/Delay' */
  real32_T Merge[2];                   /* '<S387>/Merge' */
  real32_T Merge_b;                    /* '<S368>/Merge' */
  real32_T indexing;                   /* '<S366>/indexing' */
  real32_T Lookup[4];                  /* '<S366>/Lookup' */
  real32_T Sum3;                       /* '<S367>/Sum3' */
  real32_T DataTypeConversion1;        /* '<S366>/Data Type Conversion1' */
  real32_T Sum2;                       /* '<S366>/Sum2' */
  real32_T Product_dx;                 /* '<S367>/Product' */
  real32_T Sum4;                       /* '<S367>/Sum4' */
  real32_T Sum5;                       /* '<S367>/Sum5' */
  real32_T Product1_f;                 /* '<S367>/Product1' */
  real32_T Sum6;                       /* '<S367>/Sum6' */
  real32_T id_Ld_Lq;                   /* '<S460>/Product1' */
  real32_T Add_gw;                     /* '<S460>/Add' */
  real32_T Product3_e;                 /* '<S460>/Product3' */
  real32_T u_5_Pp;                     /* '<S460>/1_5_Pp' */
  real32_T mtr2_Te_PU_i;
  real32_T Product_en;                 /* '<S460>/Product' */
  real32_T P_output;                   /* '<S460>/P_si2pu' */
  real32_T mtr2_Pm_PU_m;
  real32_T mtr2_Speed_PU_h;
  real32_T mtr2_Iab_meas_PU_j[2];
  real32_T mtr2_Pos_PU_d;
  real32_T Sum_g;                      /* '<S290>/Sum' */
  real32_T Sum_k;                      /* '<S289>/Sum' */
  real32_T Switch_l;                   /* '<S293>/Switch' */
  real32_T Product_de;                 /* '<S293>/Product' */
  real32_T Product_ii;                 /* '<S294>/Product' */
  real32_T Product1_c;                 /* '<S294>/Product1' */
  real32_T Sum1_g;                     /* '<S294>/Sum1' */
  real32_T Merge_e[2];                 /* '<S288>/Merge' */
  real32_T mtr2_VI_debug_k[6];
                   /* '<S3>/BusConversion_InsertedFor_mtr2_debug_at_inport_0' */
  real32_T DataTypeConversion_o;       /* '<S278>/Data Type Conversion' */
  real32_T Switch_n;                   /* '<S458>/Switch' */
  real32_T TmpSignalConversionAtDelayInpor[4];
  real32_T sqrt3_by_two;               /* '<S380>/sqrt3_by_two' */
  real32_T one_by_two;                 /* '<S380>/one_by_two' */
  real32_T add_c;                      /* '<S380>/add_c' */
  real32_T add_b;                      /* '<S380>/add_b' */
  real32_T Min;                        /* '<S377>/Min' */
  real32_T Max;                        /* '<S377>/Max' */
  real32_T Add_eb;                     /* '<S377>/Add' */
  real32_T one_by_two_j;               /* '<S377>/one_by_two' */
  real32_T Add3;                       /* '<S376>/Add3' */
  real32_T Add2;                       /* '<S376>/Add2' */
  real32_T Add1_jx;                    /* '<S376>/Add1' */
  real32_T Gain_jn[3];                 /* '<S376>/Gain' */
  real32_T Gain_i[3];                  /* '<S278>/Gain' */
  real32_T PWM_Duty_Cycles[3];         /* '<S278>/Sum' */
  real32_T UnitDelay1;                 /* '<S443>/Unit Delay1' */
  real32_T UnitDelay_c;                /* '<S443>/Unit Delay' */
  real32_T a;                          /* '<S443>/a' */
  real32_T Delay_k;                    /* '<S433>/Delay' */
  real32_T Sum2_l;                     /* '<S433>/Sum2' */
  real32_T Sum3_o;                     /* '<S443>/Sum3' */
  real32_T b_invg;                     /* '<S443>/b_inv*g' */
  real32_T Delay1;                     /* '<S443>/Delay1' */
  real32_T Sum4_c;                     /* '<S443>/Sum4' */
  real32_T Switch1_b4[2];              /* '<S435>/Switch1' */
  real32_T Product_af;                 /* '<S447>/Product' */
  real32_T UnitDelay_h;                /* '<S447>/Unit Delay' */
  real32_T Product1_l;                 /* '<S447>/Product1' */
  real32_T Add1_ih;                    /* '<S447>/Add1' */
  real32_T UnitDelay1_b;               /* '<S444>/Unit Delay1' */
  real32_T UnitDelay_fo;               /* '<S444>/Unit Delay' */
  real32_T a_i;                        /* '<S444>/a' */
  real32_T Delay_c;                    /* '<S434>/Delay' */
  real32_T Sum2_lr;                    /* '<S434>/Sum2' */
  real32_T Sum3_p;                     /* '<S444>/Sum3' */
  real32_T b_invg_p;                   /* '<S444>/b_inv*g' */
  real32_T Delay1_p;                   /* '<S444>/Delay1' */
  real32_T Sum4_l;                     /* '<S444>/Sum4' */
  real32_T Switch1_c[2];               /* '<S436>/Switch1' */
  real32_T Product_j;                  /* '<S450>/Product' */
  real32_T UnitDelay_d;                /* '<S450>/Unit Delay' */
  real32_T Product1_o;                 /* '<S450>/Product1' */
  real32_T Add1_a;                     /* '<S450>/Add1' */
  real32_T Merge_l;                    /* '<S432>/Merge' */
  real32_T Merge1;                     /* '<S432>/Merge1' */
  real32_T Delay_ce;                   /* '<S431>/Delay' */
  real32_T Sign_f;                     /* '<S433>/Sign' */
  real32_T Eta;                        /* '<S433>/Eta' */
  real32_T Sum_h;                      /* '<S433>/Sum' */
  real32_T b;                          /* '<S433>/b' */
  real32_T a_f;                        /* '<S433>/a' */
  real32_T Sum1_l;                     /* '<S433>/Sum1' */
  real32_T Sign_e;                     /* '<S434>/Sign' */
  real32_T Eta_b;                      /* '<S434>/Eta' */
  real32_T Sum_e;                      /* '<S434>/Sum' */
  real32_T b_i;                        /* '<S434>/b' */
  real32_T a_j;                        /* '<S434>/a' */
  real32_T Sum1_d;                     /* '<S434>/Sum1' */
  real32_T DTC;                        /* '<S455>/DTC' */
  real32_T SpeedGain;                  /* '<S438>/SpeedGain' */
  real32_T Switch1_d[2];               /* '<S437>/Switch1' */
  real32_T Product_md;                 /* '<S453>/Product' */
  real32_T UnitDelay_o;                /* '<S453>/Unit Delay' */
  real32_T Product1_je;                /* '<S453>/Product1' */
  real32_T Add1_jc;                    /* '<S453>/Add1' */
  real32_T UnitDelay_n;                /* '<S383>/Unit Delay' */
  real32_T Add_cd;                     /* '<S383>/Add' */
  real32_T V_q_ref;                    /* '<S290>/PI_Controller_Iq' */
  real32_T V_d_ref;                    /* '<S289>/PI_Controller_Id' */
  real32_T DataStoreRead;              /* '<S30>/Data Store Read' */
  real32_T Abs;                        /* '<S30>/Abs' */
  real32_T Gain_a;                     /* '<S30>/Gain' */
  real32_T UnitDelay_d5;               /* '<S167>/Unit Delay' */
  real32_T Delay5[4];                  /* '<S2>/Delay5' */
  real32_T Merge_f[2];                 /* '<S189>/Merge' */
  real32_T Switch_a;                   /* '<S30>/Switch' */
  real32_T GetADCVoltage_h[2];         /* '<S191>/Get ADC Voltage' */
  real32_T GetCurrents_g[2];           /* '<S191>/Get Currents' */
  real32_T PU_Conversion_f[2];         /* '<S191>/PU_Conversion' */
  real32_T Merge_bb;                   /* '<S174>/Merge' */
  real32_T indexing_l;                 /* '<S172>/indexing' */
  real32_T Lookup_n[4];                /* '<S172>/Lookup' */
  real32_T Sum3_m;                     /* '<S173>/Sum3' */
  real32_T DataTypeConversion1_f;      /* '<S172>/Data Type Conversion1' */
  real32_T Sum2_b;                     /* '<S172>/Sum2' */
  real32_T Product_e4;                 /* '<S173>/Product' */
  real32_T Sum4_b;                     /* '<S173>/Sum4' */
  real32_T Sum5_d;                     /* '<S173>/Sum5' */
  real32_T Product1_g1;                /* '<S173>/Product1' */
  real32_T Sum6_c;                     /* '<S173>/Sum6' */
  real32_T Sum_b;                      /* '<S38>/Sum' */
  real32_T UnitDelay_de;               /* '<S38>/Unit Delay' */
  real32_T Switch_b;                   /* '<S38>/Switch' */
  real32_T Sum_oh;                     /* '<S37>/Sum' */
  real32_T UnitDelay_p;                /* '<S37>/Unit Delay' */
  real32_T Switch_h;                   /* '<S37>/Switch' */
  real32_T Switch_m;                   /* '<S41>/Switch' */
  real32_T Product_jb;                 /* '<S41>/Product' */
  real32_T Product_it;                 /* '<S42>/Product' */
  real32_T Product1_le;                /* '<S42>/Product1' */
  real32_T Sum1_e;                     /* '<S42>/Sum1' */
  real32_T Merge_a[2];                 /* '<S36>/Merge' */
  real32_T id_Ld_Lq_p;                 /* '<S261>/Product1' */
  real32_T Add_gy;                     /* '<S261>/Add' */
  real32_T Product3_d;                 /* '<S261>/Product3' */
  real32_T u_5_Pp_b;                   /* '<S261>/1_5_Pp' */
  real32_T Product_cc;                 /* '<S261>/Product' */
  real32_T P_output_l;                 /* '<S261>/P_si2pu' */
  real32_T mtr1_speed_ref_PU;          /* '<S26>/Data Store Read' */
  real32_T TmpSignalConversionAtSelectorIn[25];
  real32_T Selector[2];                /* '<S26>/Selector' */
  real32_T DataTypeConversion_c;       /* '<S23>/Data Type Conversion' */
  real32_T Switch_p;                   /* '<S22>/Switch' */
  real32_T OutportBufferForSpeed_fb;   /* '<S2>/Input Scaling' */
  real32_T TmpSignalConversionAtDelay5Inpo[4];
  real32_T sqrt3_by_two_n;             /* '<S186>/sqrt3_by_two' */
  real32_T one_by_two_g;               /* '<S186>/one_by_two' */
  real32_T add_c_a;                    /* '<S186>/add_c' */
  real32_T add_b_o;                    /* '<S186>/add_b' */
  real32_T Min_a;                      /* '<S183>/Min' */
  real32_T Max_n;                      /* '<S183>/Max' */
  real32_T Add_b0;                     /* '<S183>/Add' */
  real32_T one_by_two_i;               /* '<S183>/one_by_two' */
  real32_T Add3_m;                     /* '<S182>/Add3' */
  real32_T Add2_p;                     /* '<S182>/Add2' */
  real32_T Add1_of;                    /* '<S182>/Add1' */
  real32_T Gain_m[3];                  /* '<S182>/Gain' */
  real32_T One_by_Two[3];              /* '<S23>/One_by_Two' */
  real32_T PWM_Duty_Cycles_i[3];       /* '<S23>/Sum' */
  real32_T UnitDelay1_f;               /* '<S245>/Unit Delay1' */
  real32_T UnitDelay_g;                /* '<S245>/Unit Delay' */
  real32_T a_g;                        /* '<S245>/a' */
  real32_T Delay_jf;                   /* '<S235>/Delay' */
  real32_T Sum2_h;                     /* '<S235>/Sum2' */
  real32_T Sum3_oo;                    /* '<S245>/Sum3' */
  real32_T b_invg_a;                   /* '<S245>/b_inv*g' */
  real32_T Delay1_h;                   /* '<S245>/Delay1' */
  real32_T Sum4_g;                     /* '<S245>/Sum4' */
  real32_T Switch1_dz[2];              /* '<S237>/Switch1' */
  real32_T Product_cx;                 /* '<S249>/Product' */
  real32_T UnitDelay_k;                /* '<S249>/Unit Delay' */
  real32_T Product1_gj;                /* '<S249>/Product1' */
  real32_T Add1_na;                    /* '<S249>/Add1' */
  real32_T UnitDelay1_d;               /* '<S246>/Unit Delay1' */
  real32_T UnitDelay_oi;               /* '<S246>/Unit Delay' */
  real32_T a_h;                        /* '<S246>/a' */
  real32_T Delay_i;                    /* '<S236>/Delay' */
  real32_T Sum2_a;                     /* '<S236>/Sum2' */
  real32_T Sum3_j;                     /* '<S246>/Sum3' */
  real32_T b_invg_k;                   /* '<S246>/b_inv*g' */
  real32_T Delay1_l;                   /* '<S246>/Delay1' */
  real32_T Sum4_d;                     /* '<S246>/Sum4' */
  real32_T Switch1_o[2];               /* '<S238>/Switch1' */
  real32_T Product_jt;                 /* '<S252>/Product' */
  real32_T UnitDelay_e;                /* '<S252>/Unit Delay' */
  real32_T Product1_ny;                /* '<S252>/Product1' */
  real32_T Add1_l;                     /* '<S252>/Add1' */
  real32_T Merge_c;                    /* '<S234>/Merge' */
  real32_T Merge1_g;                   /* '<S234>/Merge1' */
  real32_T Delay_g;                    /* '<S233>/Delay' */
  real32_T Sign_fc;                    /* '<S235>/Sign' */
  real32_T Eta_j;                      /* '<S235>/Eta' */
  real32_T Sum_o2;                     /* '<S235>/Sum' */
