giovannimasi/MATLAB_Simulink_tirocinio_2025/Examples/R2024b/c2b/DualMotorDynoUsingC2000ProcessorsExample(old)/mcb_pmsm_foc_sensorless_dyno_f28379d_ert_rtw/mcb_pmsm_foc_sensorless_dyno_f28379d.h
  real32_T b_m;                        /* '<S235>/b' */
  real32_T a_k;                        /* '<S235>/a' */
  real32_T Sum1_m;                     /* '<S235>/Sum1' */
  real32_T Sign_h;                     /* '<S236>/Sign' */
  real32_T Eta_h;                      /* '<S236>/Eta' */
  real32_T Sum_e3;                     /* '<S236>/Sum' */
  real32_T b_g;                        /* '<S236>/b' */
  real32_T a_p;                        /* '<S236>/a' */
  real32_T Sum1_p;                     /* '<S236>/Sum1' */
  real32_T DTC_a;                      /* '<S257>/DTC' */
  real32_T SpeedGain_c;                /* '<S240>/SpeedGain' */
  real32_T Switch1_k[2];               /* '<S239>/Switch1' */
  real32_T Product_pcn;                /* '<S255>/Product' */
  real32_T UnitDelay_os;               /* '<S255>/Unit Delay' */
  real32_T Product1_e;                 /* '<S255>/Product1' */
  real32_T Add1_cq;                    /* '<S255>/Add1' */
  real32_T Add_h0;                     /* '<S168>/Add' */
  real32_T DataTypeConversion1_d;      /* '<S168>/Data Type Conversion1' */
  real32_T Add1_pp;                    /* '<S168>/Add1' */
  real32_T Input;                      /* '<S169>/Input' */
  real32_T V_q_ref_m;                  /* '<S38>/PI_Controller_Iq' */
  real32_T Vd_OpenLoop;                /* '<S37>/Vd_OpenLoop' */
  real32_T Abs_k;                      /* '<S37>/Abs' */
  real32_T Saturation;                 /* '<S37>/Saturation' */
  real32_T V_d_ref_a;                  /* '<S37>/PI_Controller_Id' */
  int32_T DataTypeConversion_n[2];     /* '<S386>/Data Type Conversion' */
  int32_T Add_bh[2];                   /* '<S386>/Add' */
  int32_T SpeedCount;                  /* '<S438>/SpeedCount' */
  int32_T DataTypeConversion_j[2];     /* '<S188>/Data Type Conversion' */
  int32_T Add_f[2];                    /* '<S188>/Add' */
  int32_T SpeedCount_g;                /* '<S240>/SpeedCount' */
  uint16_T Divide2_h;                  /* '<S475>/Divide2' */
  uint16_T Divide3;                    /* '<S475>/Divide3' */
  uint16_T ForIterator;                /* '<S477>/For Iterator' */
  uint16_T ADC_A_IN1;                  /* '<S477>/ADC_A_IN1' */
  uint16_T ADC_B_IN1;                  /* '<S477>/ADC_B_IN1' */
  uint16_T Divide_f;                   /* '<S467>/Divide' */
  uint16_T Divide1_m;                  /* '<S467>/Divide1' */
  uint16_T ForIterator_p;              /* '<S469>/For Iterator' */
  uint16_T ADC_A_IN0;                  /* '<S469>/ADC_A_IN0' */
  uint16_T ADC_B_IN0;                  /* '<S469>/ADC_B_IN0' */
  uint16_T DataTypeConversion2;        /* '<S552>/Data Type Conversion2' */
  uint16_T BitwiseOperator;            /* '<S551>/Bitwise Operator' */
  uint16_T BitwiseOperator1;           /* '<S551>/Bitwise Operator1' */
  uint16_T ShiftArithmetic1;           /* '<S551>/Shift Arithmetic1' */
  uint16_T DataStoreRead1;             /* '<S386>/Data Store Read1' */
  uint16_T DataStoreRead2;             /* '<S386>/Data Store Read2' */
  uint16_T ADC_C_IN4;                  /* '<S385>/ADC_C_IN4' */
  uint16_T ADC_B_IN4;                  /* '<S385>/ADC_B_IN4' */
  uint16_T DataTypeConversion_cf;      /* '<S368>/Data Type Conversion' */
  uint16_T Get_Integer;                /* '<S366>/Get_Integer' */
  uint16_T Switch1_km;                 /* '<S293>/Switch1' */
  uint16_T Switch1_i[3];               /* '<S458>/Switch1' */
  uint16_T Scale_to_PWM_Counter_PRD[3];/* '<S458>/Scale_to_PWM_Counter_PRD' */
  uint16_T Switch2_g;                  /* '<S30>/Switch2' */
  uint16_T DataStoreRead1_o;           /* '<S188>/Data Store Read1' */
  uint16_T DataStoreRead2_m;           /* '<S188>/Data Store Read2' */
  uint16_T ADC_C_IN2;                  /* '<S187>/ADC_C_IN2' */
  uint16_T ADC_B_IN2;                  /* '<S187>/ADC_B_IN2' */
  uint16_T Switch1_of;                 /* '<S41>/Switch1' */
  uint16_T DataTypeConversion_f;       /* '<S174>/Data Type Conversion' */
  uint16_T Get_Integer_c;              /* '<S172>/Get_Integer' */
  uint16_T Output;                     /* '<S267>/Output' */
  uint16_T DataStoreRead1_a;           /* '<S26>/Data Store Read1' */
  uint16_T MultiportSwitch[2];         /* '<S26>/Multiport Switch' */
  uint16_T FixPtSum1;                  /* '<S271>/FixPt Sum1' */
  uint16_T FixPtSwitch;                /* '<S272>/FixPt Switch' */
  uint16_T Switch1_n[3];               /* '<S22>/Switch1' */
  uint16_T Scale_to_PWM_Counter_PRD_n[3];/* '<S22>/Scale_to_PWM_Counter_PRD' */
  int16_T WhileIterator;               /* '<S265>/While Iterator' */
  int16_T DataTypeConversion_g;        /* '<S168>/Data Type Conversion' */
  boolean_T DataStoreRead1_n;          /* '<S6>/Data Store Read1' */
  boolean_T DataStoreRead2_k;          /* '<S6>/Data Store Read2' */
  boolean_T Compare;                   /* '<S497>/Compare' */
  boolean_T Compare_e;                 /* '<S526>/Compare' */
  boolean_T Compare_d;                 /* '<S525>/Compare' */
  boolean_T Compare_j;                 /* '<S496>/Compare' */
  boolean_T NOT;                       /* '<S465>/NOT' */
  boolean_T NOT_i;                     /* '<S464>/NOT' */
  boolean_T DataTypeConversion3;       /* '<S551>/Data Type Conversion3' */
  boolean_T Compare_i;                 /* '<S370>/Compare' */
  boolean_T Enable;                    /* '<S3>/Enable' */
  boolean_T LogicalOperator;           /* '<S290>/Logical Operator' */
  boolean_T LogicalOperator_a;         /* '<S289>/Logical Operator' */
  boolean_T Enable_b;                  /* '<S278>/Enable' */
  boolean_T DataStoreRead1_p;          /* '<S391>/Data Store Read1' */
  boolean_T LogicalOperator_e;         /* '<S391>/Logical Operator' */
  boolean_T AlphaRelay;                /* '<S432>/AlphaRelay' */
  boolean_T BetaRelay;                 /* '<S432>/BetaRelay' */
  boolean_T DataStoreRead2_a;          /* '<S381>/Data Store Read2' */
  boolean_T DataStoreRead1_l;          /* '<S381>/Data Store Read1' */
  boolean_T AND;                       /* '<S381>/AND' */
  boolean_T NOT_d;                     /* '<S381>/NOT' */
  boolean_T Switch_ny;                 /* '<S383>/Switch' */
  boolean_T DataTypeConversion_i;      /* '<S30>/Data Type Conversion' */
  boolean_T NOT_f;                     /* '<S167>/NOT' */
  boolean_T Compare_eq;                /* '<S176>/Compare' */
  boolean_T DataStoreRead1_j;          /* '<S38>/Data Store Read1' */
  boolean_T LogicalOperator_j;         /* '<S38>/Logical Operator' */
  boolean_T DataStoreRead1_i;          /* '<S37>/Data Store Read1' */
  boolean_T LogicalOperator_f;         /* '<S37>/Logical Operator' */
  boolean_T Enable_l;                  /* '<S23>/Enable' */
  boolean_T DataStoreRead1_nk;         /* '<S193>/Data Store Read1' */
  boolean_T LogicalOperator_p;         /* '<S193>/Logical Operator' */
  boolean_T AlphaRelay_g;              /* '<S234>/AlphaRelay' */
  boolean_T BetaRelay_l;               /* '<S234>/BetaRelay' */
  boolean_T Delay_a;                   /* '<S168>/Delay' */
  rtB_SpeedControl_mcb_pmsm_foc_s SpeedControl;/* '<Root>/Speed Control' */
  rtB_SPIMasterTransfer2_mcb_pmsm SPIMasterTransfer3;/* '<S466>/SPI Master Transfer2' */
  rtB_SPIMasterTransfer2_mcb_pmsm SPIMasterTransfer2;/* '<S466>/SPI Master Transfer2' */
  rtB_SPIMasterTransfer_mcb_pmsm_ SPIMasterTransfer1;/* '<S466>/SPI Master Transfer' */
  rtB_SPIMasterTransfer_mcb_pmsm_ SPIMasterTransfer;/* '<S466>/SPI Master Transfer' */
  rtB_IfActionSubsystem_mcb_pms_h IfActionSubsystem1_l;/* '<S477>/If Action Subsystem1' */
  rtB_IfActionSubsystem_mcb_pms_h IfActionSubsystem_c;/* '<S469>/If Action Subsystem' */
  rtB_FluxObserver_mcb_pmsm_foc_s FluxObserver_a;/* '<S387>/Flux Observer' */
  rtB_angleCompensation_mcb_pmsm_ angleCompensation_p;/* '<S431>/angleCompensation' */
  rtB_Dir_Sense_mcb_pmsm_foc_sens Dir_Sense_o;/* '<S432>/Dir_Sense' */
  rtB_IfActionSubsystem1_mcb_pmsm IfActionSubsystem1_f;/* '<S368>/If Action Subsystem1' */
  rtB_IfActionSubsystem_mcb_pmsm_ IfActionSubsystem_k;/* '<S368>/If Action Subsystem' */
  rtB_TwoinputsCRL_mcb_pmsm_foc_k TwoinputsCRL_h;/* '<S283>/Two inputs CRL' */
  rtB_TwoinputsCRL_mcb_pmsm_foc_s TwoinputsCRL_e;/* '<S282>/Two inputs CRL' */
  rtB_DQEquivalence_mcb_pmsm_foc_ DQEquivalence_j;/* '<S288>/D-Q Equivalence' */
  rtB_DQAxisPriority_mcb_pmsm_foc DQAxisPriority_m;/* '<S288>/D//Q Axis Priority' */
  rtB_TwophaseCRLwrap_mcb_pmsm_fo TwophaseCRLwrap_g;/* '<S286>/Two phase CRL wrap' */
  rtB_FluxObserver_mcb_pmsm_foc_s FluxObserver;/* '<S189>/Flux Observer' */
  rtB_angleCompensation_mcb_pmsm_ angleCompensation;/* '<S233>/angleCompensation' */
  rtB_Dir_Sense_mcb_pmsm_foc_sens Dir_Sense;/* '<S234>/Dir_Sense' */
  rtB_IfActionSubsystem1_mcb_pmsm IfActionSubsystem1;/* '<S174>/If Action Subsystem1' */
  rtB_IfActionSubsystem_mcb_pmsm_ IfActionSubsystem;/* '<S174>/If Action Subsystem' */
  rtB_TwoinputsCRL_mcb_pmsm_foc_k TwoinputsCRL_p;/* '<S31>/Two inputs CRL' */
  rtB_TwoinputsCRL_mcb_pmsm_foc_s TwoinputsCRL;/* '<S29>/Two inputs CRL' */
  rtB_DQEquivalence_mcb_pmsm_foc_ DQEquivalence;/* '<S36>/D-Q Equivalence' */
  rtB_DQAxisPriority_mcb_pmsm_foc DQAxisPriority;/* '<S36>/D//Q Axis Priority' */
  rtB_TwophaseCRLwrap_mcb_pmsm_fo TwophaseCRLwrap;/* '<S34>/Two phase CRL wrap' */
} BlockIO_mcb_pmsm_foc_sensorless;

