giovannimasi/MATLAB_Simulink_tirocinio_2025/Examples/R2024b/c2b/DualMotorDynoUsingC2000ProcessorsExample(old)/mcb_pmsm_foc_sensorless_dyno_f28379d_ert_rtw/mcb_pmsm_foc_sensorless_dyno_f28379d.h
/* Block states (default storage) for system '<Root>' */
typedef struct {
  real_T DiscreteTimeIntegrator_DSTATE;/* '<S492>/Discrete-Time Integrator' */
  real_T DiscreteTimeIntegrator3_DSTATE;/* '<S539>/Discrete-Time Integrator3' */
  real_T DiscreteTimeIntegrator3_DSTAT_i;/* '<S540>/Discrete-Time Integrator3' */
  real_T UnitDelay_DSTATE;             /* '<S489>/Unit Delay' */
  real_T DiscreteTimeIntegrator3_DSTAT_e;/* '<S510>/Discrete-Time Integrator3' */
  real_T UnitDelay_DSTATE_b;           /* '<S495>/Unit Delay' */
  real_T DiscreteTimeIntegrator3_DSTAT_n;/* '<S511>/Discrete-Time Integrator3' */
  real_T UnitDelay_DSTATE_g;           /* '<S524>/Unit Delay' */
  real_T Add1_DWORK1;                  /* '<S524>/Add1' */
  real32_T UnitDelay_DSTATE_bn[2];     /* '<S622>/Unit Delay' */
  real32_T Delay_DSTATE[4];            /* '<S3>/Delay' */
  real32_T Delay_DSTATE_m;             /* '<S433>/Delay' */
  real32_T Delay1_DSTATE;              /* '<S443>/Delay1' */
  real32_T Delay_DSTATE_n;             /* '<S434>/Delay' */
  real32_T Delay1_DSTATE_i;            /* '<S444>/Delay1' */
  real32_T Delay_DSTATE_j;             /* '<S431>/Delay' */
  real32_T UnitDelay_DSTATE_gq;        /* '<S383>/Unit Delay' */
  real32_T UnitDelay_DSTATE_m;         /* '<S167>/Unit Delay' */
  real32_T Delay5_DSTATE[4];           /* '<S2>/Delay5' */
  real32_T UnitDelay_DSTATE_bc;        /* '<S38>/Unit Delay' */
  real32_T UnitDelay_DSTATE_k;         /* '<S37>/Unit Delay' */
  real32_T Delay_DSTATE_l;             /* '<S235>/Delay' */
  real32_T Delay1_DSTATE_f;            /* '<S245>/Delay1' */
  real32_T Delay_DSTATE_nx;            /* '<S236>/Delay' */
  real32_T Delay1_DSTATE_n;            /* '<S246>/Delay1' */
  real32_T Delay_DSTATE_h;             /* '<S233>/Delay' */
  volatile real32_T RT_Buffer[2];      /* '<Root>/RT' */
  volatile real32_T RT3_Buffer[2];     /* '<Root>/RT3' */
  volatile real32_T RT2_Buffer[4];     /* '<Root>/RT2' */
  volatile real32_T RateTransition3_Buffer[2];/* '<Root>/Rate Transition3' */
  volatile real32_T RT6_Buffer[4];     /* '<Root>/RT6' */
  real32_T SpeedRef;                   /* '<Root>/Data Store Memory4' */
  volatile real32_T RT8_1_Buffer[12];  /* '<Root>/RT8' */
  volatile real32_T RT8_2_Buffer[2];   /* '<Root>/RT8' */
  volatile real32_T RT8_3_Buffer[2];   /* '<Root>/RT8' */
  volatile real32_T RT8_4_Buffer[2];   /* '<Root>/RT8' */
  volatile real32_T RT8_5_Buffer[4];   /* '<Root>/RT8' */
  volatile real32_T RT8_6_Buffer[2];   /* '<Root>/RT8' */
  real32_T Add_DWORK1;                 /* '<S383>/Add' */
  real32_T integrator_state;           /* '<S290>/PI_Controller_Iq' */
  real32_T integrator_state_l;         /* '<S289>/PI_Controller_Id' */
  real32_T integrator_state_p;         /* '<S38>/PI_Controller_Iq' */
  real32_T integrator_state_j;         /* '<S37>/PI_Controller_Id' */
  int32_T DigitalOutput_FRAC_LEN;      /* '<S483>/Digital Output' */
  int32_T DigitalOutput_FRAC_LEN_o;    /* '<S466>/Digital Output' */
  int32_T BottomDRV8305EN_FRAC_LEN;    /* '<S466>/Bottom DRV8305 EN' */
  int32_T Add_DWORK1_d[2];             /* '<S386>/Add' */
  int32_T BottomDRV8305EN_FRAC_LEN_j;  /* '<S458>/Bottom DRV8305 EN' */
  int32_T SpeedCount_DWORK1;           /* '<S438>/SpeedCount' */
  int32_T Add_DWORK1_g[2];             /* '<S188>/Add' */
  int32_T DRV830xEnable_FRAC_LEN;      /* '<S22>/DRV830x Enable' */
  int32_T SpeedCount_DWORK1_f;         /* '<S240>/SpeedCount' */
  uint32_T Sum_DWORK1[4];              /* '<S366>/Sum' */
  uint32_T Sum_DWORK1_o[4];            /* '<S172>/Sum' */
  uint32_T Add_DWORK1_a;               /* '<S265>/Add' */
  uint16_T Output_DSTATE;              /* '<S267>/Output' */
  volatile int16_T RT_ActiveBufIdx;    /* '<Root>/RT' */
  volatile int16_T RT3_ActiveBufIdx;   /* '<Root>/RT3' */
  volatile int16_T RT3_semaphoreTaken; /* '<Root>/RT3' */
  volatile int16_T RT2_ActiveBufIdx;   /* '<Root>/RT2' */
  volatile int16_T RateTransition3_ActiveBufIdx;/* '<Root>/Rate Transition3' */
  volatile int16_T RT6_ActiveBufIdx;   /* '<Root>/RT6' */
  volatile int16_T RT8_1_ActiveBufIdx; /* '<Root>/RT8' */
  volatile int16_T RT8_2_ActiveBufIdx; /* '<Root>/RT8' */
  volatile int16_T RT8_3_ActiveBufIdx; /* '<Root>/RT8' */
  volatile int16_T RT8_4_ActiveBufIdx; /* '<Root>/RT8' */
  volatile int16_T RT8_5_ActiveBufIdx; /* '<Root>/RT8' */
  volatile int16_T RT8_6_ActiveBufIdx; /* '<Root>/RT8' */
  uint16_T IaOffset_motor1;            /* '<Root>/Data Store Memory1' */
  uint16_T IbOffset_motor1;            /* '<Root>/Data Store Memory2' */
  uint16_T Debug_signals;              /* '<Root>/Data Store Memory6' */
  uint16_T IbOffset_motor2;            /* '<Root>/Data Store Memory7' */
  uint16_T IaOffset_motor2;            /* '<Root>/Data Store Memory8' */
  uint16_T CircBufIdx;                 /* '<S438>/Delay' */
  uint16_T CircBufIdx_g;               /* '<S240>/Delay' */
  boolean_T Delay_DSTATE_hd;           /* '<S168>/Delay' */
  uint16_T DiscreteTimeIntegrator3_IC_LOAD;/* '<S539>/Discrete-Time Integrator3' */
  uint16_T DiscreteTimeIntegrator3_IC_LO_a;/* '<S540>/Discrete-Time Integrator3' */
  uint16_T DiscreteTimeIntegrator3_IC_LO_i;/* '<S510>/Discrete-Time Integrator3' */
  uint16_T DiscreteTimeIntegrator3_IC_LO_e;/* '<S511>/Discrete-Time Integrator3' */
  boolean_T EnMtr2TrqCtrl;             /* '<Root>/Data Store Memory5' */
  boolean_T Enable;                    /* '<Root>/Data Store Memory29' */
  boolean_T EnClosedLoop;              /* '<Root>/Data Store Memory3' */
  boolean_T AlphaRelay_Mode;           /* '<S432>/AlphaRelay' */
  boolean_T BetaRelay_Mode;            /* '<S432>/BetaRelay' */
  boolean_T AlphaRelay_Mode_g;         /* '<S234>/AlphaRelay' */
  boolean_T BetaRelay_Mode_k;          /* '<S234>/BetaRelay' */
  boolean_T EnableEnMtr2TrqCtrlafter2secdel;
                           /* '<S381>/Enable EnMtr2TrqCtrl after 2 sec delay' */
  rtDW_SpeedControl_mcb_pmsm_foc_ SpeedControl;/* '<Root>/Speed Control' */
  rtDW_SPIMasterTransfer2_mcb_pms SPIMasterTransfer3;/* '<S466>/SPI Master Transfer2' */
  rtDW_SPIMasterTransfer2_mcb_pms SPIMasterTransfer2;/* '<S466>/SPI Master Transfer2' */
  rtDW_SPIMasterTransfer_mcb_pmsm SPIMasterTransfer1;/* '<S466>/SPI Master Transfer' */
  rtDW_SPIMasterTransfer_mcb_pmsm SPIMasterTransfer;/* '<S466>/SPI Master Transfer' */
  rtDW_IfActionSubsystem_mcb_pm_n IfActionSubsystem1_l;/* '<S477>/If Action Subsystem1' */
  rtDW_IfActionSubsystem_mcb_pm_n IfActionSubsystem_c;/* '<S469>/If Action Subsystem' */
  rtDW_FluxObserver_mcb_pmsm_foc_ FluxObserver_a;/* '<S387>/Flux Observer' */
  rtDW_FluxObserver_mcb_pmsm_foc_ FluxObserver;/* '<S189>/Flux Observer' */
} D_Work_mcb_pmsm_foc_sensorless_;

