giovannimasi/MATLAB_Simulink_tirocinio_2025/Examples/R2024b/c2b/DualMotorDynoUsingC2000ProcessorsExample(old)/mcb_pmsm_foc_sensorless_dyno_f28379d_ert_rtw/mcb_pmsm_foc_sensorless_dyno_f28379d.h
/* Zero-crossing (trigger) state */
typedef struct {
  rtZCE_FluxObserver_mcb_pmsm_foc FluxObserver_a;/* '<S387>/Flux Observer' */
  ZCSigState Delay_Reset_ZCE_b;        /* '<S433>/Delay' */
  ZCSigState Delay1_Reset_ZCE_j;       /* '<S443>/Delay1' */
  ZCSigState Delay_Reset_ZCE_l;        /* '<S434>/Delay' */
  ZCSigState Delay1_Reset_ZCE_d;       /* '<S444>/Delay1' */
  ZCSigState Delay_Reset_ZCE_m;        /* '<S431>/Delay' */
  rtZCE_Dir_Sense_mcb_pmsm_foc_se Dir_Sense_o;/* '<S432>/Dir_Sense' */
  rtZCE_FluxObserver_mcb_pmsm_foc FluxObserver;/* '<S189>/Flux Observer' */
  ZCSigState Delay_Reset_ZCE_o;        /* '<S235>/Delay' */
  ZCSigState Delay1_Reset_ZCE_l;       /* '<S245>/Delay1' */
  ZCSigState Delay_Reset_ZCE_lr;       /* '<S236>/Delay' */
  ZCSigState Delay1_Reset_ZCE_bs;      /* '<S246>/Delay1' */
  ZCSigState Delay_Reset_ZCE_bh;       /* '<S233>/Delay' */
  rtZCE_Dir_Sense_mcb_pmsm_foc_se Dir_Sense;/* '<S234>/Dir_Sense' */
} PrevZCSigStates_mcb_pmsm_foc_se;

/* Invariant block signals (default storage) */
typedef struct {
  const real_T IndexVector;            /* '<S492>/Index Vector' */
  const real_T IndexVector1;           /* '<S492>/Index Vector1' */
  const real_T IndexVector2;           /* '<S492>/Index Vector2' */
  const real_T IndexVector_c;          /* '<S509>/Index Vector' */
  const real_T IndexVector1_m;         /* '<S509>/Index Vector1' */
  const real_T Add;                    /* '<S509>/Add' */
  const real_T IndexVector_l;          /* '<S510>/Index Vector' */
  const real_T IndexVector_k;          /* '<S512>/Index Vector' */
  const real_T IndexVector_ko;         /* '<S513>/Index Vector' */
  const real_T IndexVector2_g;         /* '<S513>/Index Vector2' */
  const real_T IndexVector_b;          /* '<S514>/Index Vector' */
  const real_T IndexVector_bl;         /* '<S511>/Index Vector' */
  const real_T IndexVector_g;          /* '<S515>/Index Vector' */
  const real_T IndexVector_i;          /* '<S516>/Index Vector' */
  const real_T IndexVector1_f;         /* '<S516>/Index Vector1' */
  const real_T IndexVector_bj;         /* '<S517>/Index Vector' */
  const real_T IndexVector_j;          /* '<S518>/Index Vector' */
  const real_T IndexVector_ku;         /* '<S538>/Index Vector' */
  const real_T IndexVector1_n;         /* '<S538>/Index Vector1' */
  const real_T Add_l;                  /* '<S538>/Add' */
  const real_T IndexVector_cx;         /* '<S539>/Index Vector' */
  const real_T IndexVector_gy;         /* '<S541>/Index Vector' */
  const real_T IndexVector_h;          /* '<S542>/Index Vector' */
  const real_T IndexVector1_mr;        /* '<S542>/Index Vector1' */
  const real_T IndexVector_ca;         /* '<S543>/Index Vector' */
  const real_T IndexVector_bp;         /* '<S540>/Index Vector' */
  const real_T IndexVector_d;          /* '<S544>/Index Vector' */
  const real_T IndexVector_f;          /* '<S545>/Index Vector' */
  const real_T IndexVector1_fl;        /* '<S545>/Index Vector1' */
  const real_T IndexVector_kue;        /* '<S546>/Index Vector' */
  const real_T IndexVector_l0;         /* '<S547>/Index Vector' */
  const uint32_T Width;                /* '<S264>/Width' */
  const real32_T Ld_Port;              /* '<S461>/Gain' */
  const real32_T Switch;               /* '<S461>/Switch' */
  const real32_T Lq_Port;              /* '<S461>/Gain1' */
  const real32_T Switch1;              /* '<S461>/Switch1' */
  const real32_T FluxPM_Port;          /* '<S461>/Gain2' */
  const real32_T Switch2;              /* '<S461>/Switch2' */
  const real32_T Ld_Lq;                /* '<S460>/Subtract' */
  const real32_T Ld_Port_b;            /* '<S262>/Gain' */
  const real32_T Switch_g;             /* '<S262>/Switch' */
  const real32_T Lq_Port_c;            /* '<S262>/Gain1' */
  const real32_T Switch1_d;            /* '<S262>/Switch1' */
  const real32_T FluxPM_Port_d;        /* '<S262>/Gain2' */
  const real32_T Switch2_h;            /* '<S262>/Switch2' */
  const real32_T Ld_Lq_a;              /* '<S261>/Subtract' */
} ConstBlockIO_mcb_pmsm_foc_senso;

/* Constant parameters (default storage) */
typedef struct {
  /* Pooled Parameter (Expression: )
   * Referenced by:
   *   '<S172>/sine_table_values'
   *   '<S366>/sine_table_values'
   */
  real32_T pooled73[1002];
} ConstParam_mcb_pmsm_foc_sensorl;

/* Real-time Model Data Structure */
struct tag_RTM_mcb_pmsm_foc_sensorless {
  const char_T * volatile errorStatus;

  /*
   * Timing:
   * The following substructure contains information regarding
   * the timing information for the model.
   */
  struct {
    uint32_T clockTick0;
    uint32_T clockTickH0;
    struct {
      uint16_T TID[3];
    } TaskCounters;
  } Timing;
};

/* Block signals (default storage) */
extern BlockIO_mcb_pmsm_foc_sensorless mcb_pmsm_foc_sensorless_dyno__B;

/* Block states (default storage) */
extern D_Work_mcb_pmsm_foc_sensorless_ mcb_pmsm_foc_sensorless_d_DWork;

/* Zero-crossing (trigger) state */
extern PrevZCSigStates_mcb_pmsm_foc_se mcb_pmsm_foc_sen_PrevZCSigState;
extern const ConstBlockIO_mcb_pmsm_foc_senso mcb_pmsm_foc_sensorless__ConstB;/* constant block i/o */

/* Constant parameters (default storage) */
extern const ConstParam_mcb_pmsm_foc_sensorl mcb_pmsm_foc_sensorless__ConstP;

/* External function called from main */
extern void mcb_pmsm_foc_sensorless_dyno_f28379d_SetEventsForThisBaseStep
  (boolean_T *eventFlags);

/* Model entry point functions */
extern void mcb_pmsm_foc_sensorless_dyno_f28379d_initialize(void);
extern void mcb_pmsm_foc_sensorless_dyno_f28379d_step0(void);/* Sample time: [2.5E-5s, 0.0s] */
extern void mcb_pmsm_foc_sensorless_dyno_f28379d_step1(void);/* Sample time: [0.001s, 0.0s] */
extern void mcb_pmsm_foc_sensorless_dyno_f28379d_step2(void);/* Sample time: [0.5s, 0.0s] */
extern void mcb_pmsm_foc_sensorless_dyno_f28379d_terminate(void);

/* Real-time Model object */
extern RT_MODEL_mcb_pmsm_foc_sensorles *const mcb_pmsm_foc_sensorless_dyno_M;
extern volatile boolean_T stopRequested;
extern volatile boolean_T runModel;

#ifdef __cpluscplus

extern "C"
{

#endif

