giovannimasi/MATLAB_Simulink_tirocinio_2025/Examples/R2024b/c2b/DualMotorDynoUsingC2000ProcessorsExample(old)/mcb_pmsm_foc_sensorless_dyno_f28379d_ert_rtw/mcb_pmsm_foc_sensorless_dyno_f28379d.h
  interrupt void ADCB1_INT(void);
  interrupt void ADCC1_INT(void);
  interrupt void SCIA_RX_INT(void);
  void mcb_pmsm_foc_sensorless_dyno_f28379d_configure_interrupts (void);
  void mcb_pmsm_foc_sensorless_dyno_f28379d_unconfigure_interrupts (void);

#ifdef __cpluscplus

}

#endif

/*-
 * The generated code includes comments that allow you to trace directly
 * back to the appropriate location in the model.  The basic format
 * is <system>/block_name, where system is the system number (uniquely
 * assigned by Simulink) and block_name is the name of the block.
 *
 * Use the MATLAB hilite_system command to trace the generated code back
 * to the model.  For example,
 *
 * hilite_system('<S3>')    - opens system 3
 * hilite_system('<S3>/Kp') - opens and selects block Kp which resides in S3
 *
 * Here is the system hierarchy for this model
 *
 * '<Root>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d'
 * '<S1>'   : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Code generation'
 * '<S2>'   : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1'
 * '<S3>'   : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 2'
 * '<S4>'   : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Hardware Init'
 * '<S5>'   : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Heartbeat LED'
 * '<S6>'   : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Motor1 and Motor2 coupled'
 * '<S7>'   : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Serial Receive'
 * '<S8>'   : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Speed Control'
 * '<S9>'   : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Torque Demand'
 * '<S10>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Code generation/HWI_ADCB1_INT'
 * '<S11>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Code generation/HWI_ADCC1_INT'
 * '<S12>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Code generation/HWI_SCIA_RX_INT'
 * '<S13>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Code generation/HWI_ADCB1_INT/ECSoC'
 * '<S14>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Code generation/HWI_ADCB1_INT/ECSoC/ECSimCodegen'
 * '<S15>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Code generation/HWI_ADCC1_INT/ECSoC'
 * '<S16>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Code generation/HWI_ADCC1_INT/ECSoC/ECSimCodegen'
 * '<S17>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Code generation/HWI_SCIA_RX_INT/ECSoC'
 * '<S18>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Code generation/HWI_SCIA_RX_INT/ECSoC/ECSimCodegen'
 * '<S19>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop'
 * '<S20>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/HW_Inputs'
 * '<S21>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling'
 * '<S22>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Inverter (Code Generation)'
 * '<S23>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Output Scaling'
 * '<S24>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/PMSM Torque Estimator1'
 * '<S25>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/SCI (Code Generation)'
 * '<S26>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Subsystem'
 * '<S27>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Clarke Transform'
 * '<S28>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers'
 * '<S29>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Inverse Park Transform'
 * '<S30>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Open_Loop_Control'
 * '<S31>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Park Transform'
 * '<S32>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Sine-Cosine Lookup'
 * '<S33>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Space Vector Generator'
 * '<S34>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Clarke Transform/Two phase input'
 * '<S35>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Clarke Transform/Two phase input/Two phase CRL wrap'
 * '<S36>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/DQ Limiter'
 * '<S37>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Id'
 * '<S38>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Iq'
 * '<S39>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/DQ Limiter/D-Q Equivalence'
 * '<S40>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/DQ Limiter/D//Q Axis Priority'
 * '<S41>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/DQ Limiter/Inport//Dialog Selection'
 * '<S42>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/DQ Limiter/Magnitude_calc'
 * '<S43>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/DQ Limiter/D-Q Equivalence/Limiter'
 * '<S44>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/DQ Limiter/D-Q Equivalence/Passthrough'
 * '<S45>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/DQ Limiter/D//Q Axis Priority/Compare To Constant'
 * '<S46>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/DQ Limiter/D//Q Axis Priority/Compare To Constant1'
 * '<S47>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/DQ Limiter/D//Q Axis Priority/flipInputs'
 * '<S48>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/DQ Limiter/D//Q Axis Priority/flipInputs1'
 * '<S49>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/DQ Limiter/D//Q Axis Priority/limiter'
 * '<S50>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/DQ Limiter/D//Q Axis Priority/limiter/limitRef1'
 * '<S51>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/DQ Limiter/D//Q Axis Priority/limiter/limitRef2'
 * '<S52>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/DQ Limiter/D//Q Axis Priority/limiter/passThrough'
 * '<S53>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset'
 * '<S54>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Id/PI_Controller_Id'
 * '<S55>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Anti-windup'
 * '<S56>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/D Gain'
 * '<S57>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/External Derivative'
 * '<S58>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Filter'
 * '<S59>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Filter ICs'
 * '<S60>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/I Gain'
 * '<S61>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Ideal P Gain'
 * '<S62>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Ideal P Gain Fdbk'
 * '<S63>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Integrator'
 * '<S64>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Integrator ICs'
 * '<S65>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/N Copy'
 * '<S66>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/N Gain'
 * '<S67>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/P Copy'
 * '<S68>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Parallel P Gain'
 * '<S69>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Reset Signal'
 * '<S70>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Saturation'
 * '<S71>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Saturation Fdbk'
 * '<S72>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Sum'
 * '<S73>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Sum Fdbk'
 * '<S74>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Tracking Mode'
 * '<S75>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Tracking Mode Sum'
 * '<S76>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Tsamp - Integral'
 * '<S77>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Tsamp - Ngain'
 * '<S78>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/postSat Signal'
 * '<S79>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/preInt Signal'
 * '<S80>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/preSat Signal'
 * '<S81>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Anti-windup/Disc. Clamping Parallel'
 * '<S82>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Anti-windup/Disc. Clamping Parallel/Dead Zone'
 * '<S83>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Anti-windup/Disc. Clamping Parallel/Dead Zone/Enabled'
 * '<S84>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/D Gain/Disabled'
 * '<S85>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/External Derivative/Disabled'
 * '<S86>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Filter/Disabled'
 * '<S87>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Filter ICs/Disabled'
 * '<S88>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/I Gain/External Parameters'
 * '<S89>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Ideal P Gain/Passthrough'
 * '<S90>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Ideal P Gain Fdbk/Disabled'
 * '<S91>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Integrator/Discrete'
 * '<S92>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Integrator ICs/External IC'
 * '<S93>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/N Copy/Disabled wSignal Specification'
 * '<S94>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/N Gain/Disabled'
 * '<S95>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/P Copy/Disabled'
 * '<S96>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Parallel P Gain/External Parameters'
 * '<S97>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Reset Signal/External Reset'
 * '<S98>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Saturation/Enabled'
 * '<S99>'  : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Saturation Fdbk/Disabled'
 * '<S100>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Sum/Sum_PI'
 * '<S101>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Sum Fdbk/Disabled'
 * '<S102>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Tracking Mode/Disabled'
 * '<S103>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Tracking Mode Sum/Passthrough'
 * '<S104>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Tsamp - Integral/TsSignalSpecification'
 * '<S105>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Tsamp - Ngain/Passthrough'
 * '<S106>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/postSat Signal/Forward_Path'
 * '<S107>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/preInt Signal/Internal PreInt'
 * '<S108>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/preSat Signal/Forward_Path'
 * '<S109>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset'
 * '<S110>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Iq/PI_Controller_Iq'
 * '<S111>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Anti-windup'
 * '<S112>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/D Gain'
 * '<S113>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/External Derivative'
 * '<S114>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Filter'
 * '<S115>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Filter ICs'
 * '<S116>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/I Gain'
 * '<S117>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Ideal P Gain'
 * '<S118>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Ideal P Gain Fdbk'
 * '<S119>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Integrator'
 * '<S120>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Integrator ICs'
 * '<S121>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/N Copy'
 * '<S122>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/N Gain'
 * '<S123>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/P Copy'
 * '<S124>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Parallel P Gain'
 * '<S125>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Reset Signal'
 * '<S126>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Saturation'
 * '<S127>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Saturation Fdbk'
 * '<S128>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Sum'
 * '<S129>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Sum Fdbk'
 * '<S130>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Tracking Mode'
 * '<S131>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Tracking Mode Sum'
 * '<S132>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Tsamp - Integral'
 * '<S133>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Tsamp - Ngain'
 * '<S134>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/postSat Signal'
 * '<S135>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/preInt Signal'
 * '<S136>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/preSat Signal'
 * '<S137>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Anti-windup/Disc. Clamping Parallel'
 * '<S138>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Anti-windup/Disc. Clamping Parallel/Dead Zone'
 * '<S139>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Anti-windup/Disc. Clamping Parallel/Dead Zone/Enabled'
 * '<S140>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/D Gain/Disabled'
 * '<S141>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/External Derivative/Disabled'
 * '<S142>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Filter/Disabled'
 * '<S143>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Filter ICs/Disabled'
