giovannimasi/MATLAB_Simulink_tirocinio_2025/Examples/R2024b/c2b/DualMotorDynoUsingC2000ProcessorsExample(old)/mcb_pmsm_foc_sensorless_dyno_f28379d_ert_rtw/mcb_pmsm_foc_sensorless_dyno_f28379d.h
 * '<S144>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/I Gain/External Parameters'
 * '<S145>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Ideal P Gain/Passthrough'
 * '<S146>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Ideal P Gain Fdbk/Disabled'
 * '<S147>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Integrator/Discrete'
 * '<S148>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Integrator ICs/External IC'
 * '<S149>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/N Copy/Disabled wSignal Specification'
 * '<S150>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/N Gain/Disabled'
 * '<S151>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/P Copy/Disabled'
 * '<S152>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Parallel P Gain/External Parameters'
 * '<S153>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Reset Signal/External Reset'
 * '<S154>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Saturation/Enabled'
 * '<S155>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Saturation Fdbk/Disabled'
 * '<S156>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Sum/Sum_PI'
 * '<S157>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Sum Fdbk/Disabled'
 * '<S158>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Tracking Mode/Disabled'
 * '<S159>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Tracking Mode Sum/Passthrough'
 * '<S160>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Tsamp - Integral/TsSignalSpecification'
 * '<S161>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Tsamp - Ngain/Passthrough'
 * '<S162>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/postSat Signal/Forward_Path'
 * '<S163>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/preInt Signal/Internal PreInt'
 * '<S164>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/preSat Signal/Forward_Path'
 * '<S165>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Inverse Park Transform/Two inputs CRL'
 * '<S166>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Inverse Park Transform/Two inputs CRL/Switch_Axis'
 * '<S167>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Open_Loop_Control/Position Generator'
 * '<S168>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Open_Loop_Control/Position Generator/Accumulate'
 * '<S169>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Open_Loop_Control/Position Generator/Accumulate/Subsystem'
 * '<S170>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Park Transform/Two inputs CRL'
 * '<S171>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Park Transform/Two inputs CRL/Switch_Axis'
 * '<S172>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Sine-Cosine Lookup/Sine-Cosine Lookup'
 * '<S173>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Sine-Cosine Lookup/Sine-Cosine Lookup/Interpolation'
 * '<S174>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Sine-Cosine Lookup/Sine-Cosine Lookup/WrapUp'
 * '<S175>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Sine-Cosine Lookup/Sine-Cosine Lookup/datatype'
 * '<S176>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Sine-Cosine Lookup/Sine-Cosine Lookup/WrapUp/Compare To Zero'
 * '<S177>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Sine-Cosine Lookup/Sine-Cosine Lookup/WrapUp/If Action Subsystem'
 * '<S178>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Sine-Cosine Lookup/Sine-Cosine Lookup/WrapUp/If Action Subsystem1'
 * '<S179>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Sine-Cosine Lookup/Sine-Cosine Lookup/datatype/datatype backpropogation'
 * '<S180>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Space Vector Generator/Modulation method'
 * '<S181>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Space Vector Generator/Voltage Input'
 * '<S182>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Space Vector Generator/Modulation method/SVPWM'
 * '<S183>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Space Vector Generator/Modulation method/SVPWM/Half(Vmin+Vmax)'
 * '<S184>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Space Vector Generator/Voltage Input/Valphabeta'
 * '<S185>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Space Vector Generator/Voltage Input/Valphabeta/Inverse Clarke Transform'
 * '<S186>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Closed Loop/Space Vector Generator/Voltage Input/Valphabeta/Inverse Clarke Transform/Two phase input'
 * '<S187>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/HW_Inputs/Sensor Driver Blocks (codegen)'
 * '<S188>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate Phase Currents'
 * '<S189>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate position and speed'
 * '<S190>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate Phase Currents/Data_Type'
 * '<S191>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate Phase Currents/Data_Type/Data_Type_Float'
 * '<S192>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate position and speed/Flux Observer'
 * '<S193>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate position and speed/Sliding Mode Observer'
 * '<S194>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate position and speed/Flux Observer/DC component removal'
 * '<S195>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer'
 * '<S196>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate position and speed/Flux Observer/IIR Filter'
 * '<S197>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate position and speed/Flux Observer/Speed Measurement'
 * '<S198>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate position and speed/Flux Observer/DC component removal/IIR Filter'
 * '<S199>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate position and speed/Flux Observer/DC component removal/IIR Filter/IIR Filter'
 * '<S200>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate position and speed/Flux Observer/DC component removal/IIR Filter/IIR Filter/Low-pass'
 * '<S201>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate position and speed/Flux Observer/DC component removal/IIR Filter/IIR Filter/Low-pass/IIR Low Pass Filter'
 * '<S202>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/Atan2'
 * '<S203>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/Data type Handling'
 * '<S204>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/Flux Calculation'
 * '<S205>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/ParamBus'
 * '<S206>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/passthrough'
 * '<S207>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/psiAlpha'
 * '<S208>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/psiBeta'
 * '<S209>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/Atan2/Default'
 * '<S210>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/Atan2/Default/atan2'
 * '<S211>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/Atan2/Default/atan2/Per Unit'
 * '<S212>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/psiAlpha/Default'
 * '<S213>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/psiAlpha/Default/FluxCalc'
 * '<S214>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/psiAlpha/Default/FluxCalc/IIR Filter'
 * '<S215>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/psiAlpha/Default/FluxCalc/Integrator'
 * '<S216>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/psiAlpha/Default/FluxCalc/Scaling'
 * '<S217>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/psiAlpha/Default/FluxCalc/IIR Filter/IIR Filter'
 * '<S218>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/psiAlpha/Default/FluxCalc/IIR Filter/IIR Filter/High-pass'
 * '<S219>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/psiAlpha/Default/FluxCalc/IIR Filter/IIR Filter/High-pass/IIR Low Pass Filter'
 * '<S220>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/psiBeta/Default'
 * '<S221>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/psiBeta/Default/FluxCalc'
 * '<S222>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/psiBeta/Default/FluxCalc/IIR Filter'
 * '<S223>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/psiBeta/Default/FluxCalc/Integrator'
 * '<S224>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/psiBeta/Default/FluxCalc/Scaling'
 * '<S225>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/psiBeta/Default/FluxCalc/IIR Filter/IIR Filter'
 * '<S226>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/psiBeta/Default/FluxCalc/IIR Filter/IIR Filter/High-pass'
 * '<S227>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/psiBeta/Default/FluxCalc/IIR Filter/IIR Filter/High-pass/IIR Low Pass Filter'
 * '<S228>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate position and speed/Flux Observer/IIR Filter/IIR Filter'
 * '<S229>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate position and speed/Flux Observer/IIR Filter/IIR Filter/Low-pass'
 * '<S230>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate position and speed/Flux Observer/IIR Filter/IIR Filter/Low-pass/IIR Low Pass Filter'
 * '<S231>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate position and speed/Flux Observer/Speed Measurement/DT_Handle'
 * '<S232>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate position and speed/Flux Observer/Speed Measurement/DT_Handle/floating-point'
 * '<S233>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer'
 * '<S234>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer/Direction_Latch'
 * '<S235>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer/Ealpha_est'
 * '<S236>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer/Ebeta_est'
 * '<S237>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer/Filter_Ealpha'
 * '<S238>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer/Filter_Ebeta'
 * '<S239>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer/IIR Filter'
 * '<S240>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer/Speed Measurement'
 * '<S241>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer/angleCompensation'
 * '<S242>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer/Direction_Latch/Dir_Sense'
 * '<S243>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer/Direction_Latch/Subsystem2'
 * '<S244>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer/Direction_Latch/Subsystem3'
 * '<S245>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer/Ealpha_est/DisturbanceObserver'
 * '<S246>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer/Ebeta_est/DisturbanceObserver'
 * '<S247>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer/Filter_Ealpha/IIR Filter'
 * '<S248>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer/Filter_Ealpha/IIR Filter/Low-pass'
 * '<S249>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer/Filter_Ealpha/IIR Filter/Low-pass/IIR Low Pass Filter'
 * '<S250>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer/Filter_Ebeta/IIR Filter'
 * '<S251>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer/Filter_Ebeta/IIR Filter/Low-pass'
 * '<S252>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer/Filter_Ebeta/IIR Filter/Low-pass/IIR Low Pass Filter'
 * '<S253>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer/IIR Filter/IIR Filter'
 * '<S254>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer/IIR Filter/IIR Filter/Low-pass'
 * '<S255>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer/IIR Filter/IIR Filter/Low-pass/IIR Low Pass Filter'
 * '<S256>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer/Speed Measurement/DT_Handle'
 * '<S257>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer/Speed Measurement/DT_Handle/floating-point'
 * '<S258>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer/angleCompensation/atan1'
 * '<S259>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer/angleCompensation/atan1/Per Unit'
 * '<S260>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/PMSM Torque Estimator1/Variant Subsystem'
 * '<S261>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/PMSM Torque Estimator1/Variant Subsystem/Torque Estimator_LumpedParameters_InputPort'
 * '<S262>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/PMSM Torque Estimator1/Variant Subsystem/Torque Estimator_LumpedParameters_InputPort/LumpedParams_InputPorts'
 * '<S263>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/SCI (Code Generation)/Data_Conditioning_Tx'
 * '<S264>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/SCI (Code Generation)/Data_Logging'
 * '<S265>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/SCI (Code Generation)/While Iterator Subsystem'
 * '<S266>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/SCI (Code Generation)/Data_Conditioning_Tx/Data_Type_Float'
 * '<S267>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/SCI (Code Generation)/Data_Logging/Counter Limited'
 * '<S268>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/SCI (Code Generation)/Data_Logging/Data'
 * '<S269>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/SCI (Code Generation)/Data_Logging/End'
 * '<S270>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/SCI (Code Generation)/Data_Logging/Start'
 * '<S271>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/SCI (Code Generation)/Data_Logging/Counter Limited/Increment Real World'
 * '<S272>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 1/SCI (Code Generation)/Data_Logging/Counter Limited/Wrap To Zero'
 * '<S273>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 2/Closed loop'
 * '<S274>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 2/Enable Motor2 after a delay'
 * '<S275>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 2/HW_Inputs'
 * '<S276>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 2/Input Scaling'
 * '<S277>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 2/Inverter Driver Peripherals'
 * '<S278>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 2/Output Scaling'
 * '<S279>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 2/PMSM Torque Estimator1'
 * '<S280>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 2/Closed loop/Clarke Transform'
 * '<S281>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 2/Closed loop/Current_Controllers'
 * '<S282>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 2/Closed loop/Inverse Park Transform'
 * '<S283>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 2/Closed loop/Park Transform'
 * '<S284>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 2/Closed loop/Sine-Cosine Lookup'
 * '<S285>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 2/Closed loop/Space Vector Generator'
 * '<S286>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 2/Closed loop/Clarke Transform/Two phase input'
 * '<S287>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 2/Closed loop/Clarke Transform/Two phase input/Two phase CRL wrap'
 * '<S288>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 2/Closed loop/Current_Controllers/DQ Limiter'
 * '<S289>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 2/Closed loop/Current_Controllers/PI_Controller_Id'
 * '<S290>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 2/Closed loop/Current_Controllers/PI_Controller_Iq'
 * '<S291>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 2/Closed loop/Current_Controllers/DQ Limiter/D-Q Equivalence'
 * '<S292>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 2/Closed loop/Current_Controllers/DQ Limiter/D//Q Axis Priority'
 * '<S293>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 2/Closed loop/Current_Controllers/DQ Limiter/Inport//Dialog Selection'
