giovannimasi/MATLAB_Simulink_tirocinio_2025/Examples/R2024b/c2b/DualMotorDynoUsingC2000ProcessorsExample(old)/mcb_pmsm_foc_sensorless_dyno_f28379d_ert_rtw/mcb_pmsm_foc_sensorless_dyno_f28379d.h
 * '<S434>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 2/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer/Ebeta_est'
 * '<S435>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 2/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer/Filter_Ealpha'
 * '<S436>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 2/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer/Filter_Ebeta'
 * '<S437>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 2/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer/IIR Filter'
 * '<S438>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 2/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer/Speed Measurement'
 * '<S439>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 2/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer/angleCompensation'
 * '<S440>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 2/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer/Direction_Latch/Dir_Sense'
 * '<S441>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 2/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer/Direction_Latch/Subsystem2'
 * '<S442>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 2/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer/Direction_Latch/Subsystem3'
 * '<S443>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 2/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer/Ealpha_est/DisturbanceObserver'
 * '<S444>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 2/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer/Ebeta_est/DisturbanceObserver'
 * '<S445>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 2/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer/Filter_Ealpha/IIR Filter'
 * '<S446>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 2/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer/Filter_Ealpha/IIR Filter/Low-pass'
 * '<S447>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 2/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer/Filter_Ealpha/IIR Filter/Low-pass/IIR Low Pass Filter'
 * '<S448>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 2/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer/Filter_Ebeta/IIR Filter'
 * '<S449>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 2/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer/Filter_Ebeta/IIR Filter/Low-pass'
 * '<S450>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 2/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer/Filter_Ebeta/IIR Filter/Low-pass/IIR Low Pass Filter'
 * '<S451>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 2/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer/IIR Filter/IIR Filter'
 * '<S452>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 2/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer/IIR Filter/IIR Filter/Low-pass'
 * '<S453>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 2/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer/IIR Filter/IIR Filter/Low-pass/IIR Low Pass Filter'
 * '<S454>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 2/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer/Speed Measurement/DT_Handle'
 * '<S455>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 2/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer/Speed Measurement/DT_Handle/floating-point'
 * '<S456>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 2/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer/angleCompensation/atan1'
 * '<S457>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 2/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer/angleCompensation/atan1/Per Unit'
 * '<S458>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 2/Inverter Driver Peripherals/Inverter (Code Generation)'
 * '<S459>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 2/PMSM Torque Estimator1/Variant Subsystem'
 * '<S460>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 2/PMSM Torque Estimator1/Variant Subsystem/Torque Estimator_LumpedParameters_InputPort'
 * '<S461>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/FOC Algorithm Motor 2/PMSM Torque Estimator1/Variant Subsystem/Torque Estimator_LumpedParameters_InputPort/LumpedParams_InputPorts'
 * '<S462>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Hardware Init/HW_Init'
 * '<S463>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Hardware Init/HW_Init/HW_Init (Codegen)'
 * '<S464>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Hardware Init/HW_Init/HW_Init (Codegen)/Calibrate ADC offset for motor 1 current sensor'
 * '<S465>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Hardware Init/HW_Init/HW_Init (Codegen)/Calibrate ADC offset for motor 2 current sensor'
 * '<S466>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Hardware Init/HW_Init/HW_Init (Codegen)/Enable DRV8305 for motor 1 and motor 2'
 * '<S467>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Hardware Init/HW_Init/HW_Init (Codegen)/Calibrate ADC offset for motor 1 current sensor/Calculate ADC Offset '
 * '<S468>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Hardware Init/HW_Init/HW_Init (Codegen)/Calibrate ADC offset for motor 1 current sensor/Default ADC Offset'
 * '<S469>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Hardware Init/HW_Init/HW_Init (Codegen)/Calibrate ADC offset for motor 1 current sensor/Calculate ADC Offset /For Iterator Subsystem'
 * '<S470>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Hardware Init/HW_Init/HW_Init (Codegen)/Calibrate ADC offset for motor 1 current sensor/Calculate ADC Offset /If Action Subsystem'
 * '<S471>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Hardware Init/HW_Init/HW_Init (Codegen)/Calibrate ADC offset for motor 1 current sensor/Calculate ADC Offset /If Action Subsystem1'
 * '<S472>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Hardware Init/HW_Init/HW_Init (Codegen)/Calibrate ADC offset for motor 1 current sensor/Calculate ADC Offset /If Action Subsystem2'
 * '<S473>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Hardware Init/HW_Init/HW_Init (Codegen)/Calibrate ADC offset for motor 1 current sensor/Calculate ADC Offset /If Action Subsystem3'
 * '<S474>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Hardware Init/HW_Init/HW_Init (Codegen)/Calibrate ADC offset for motor 1 current sensor/Calculate ADC Offset /For Iterator Subsystem/If Action Subsystem'
 * '<S475>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Hardware Init/HW_Init/HW_Init (Codegen)/Calibrate ADC offset for motor 2 current sensor/Calculate ADC Offset'
 * '<S476>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Hardware Init/HW_Init/HW_Init (Codegen)/Calibrate ADC offset for motor 2 current sensor/Default ADC Offset'
 * '<S477>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Hardware Init/HW_Init/HW_Init (Codegen)/Calibrate ADC offset for motor 2 current sensor/Calculate ADC Offset/For Iterator Subsystem'
 * '<S478>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Hardware Init/HW_Init/HW_Init (Codegen)/Calibrate ADC offset for motor 2 current sensor/Calculate ADC Offset/If Action Subsystem4'
 * '<S479>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Hardware Init/HW_Init/HW_Init (Codegen)/Calibrate ADC offset for motor 2 current sensor/Calculate ADC Offset/If Action Subsystem5'
 * '<S480>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Hardware Init/HW_Init/HW_Init (Codegen)/Calibrate ADC offset for motor 2 current sensor/Calculate ADC Offset/If Action Subsystem6'
 * '<S481>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Hardware Init/HW_Init/HW_Init (Codegen)/Calibrate ADC offset for motor 2 current sensor/Calculate ADC Offset/If Action Subsystem7'
 * '<S482>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Hardware Init/HW_Init/HW_Init (Codegen)/Calibrate ADC offset for motor 2 current sensor/Calculate ADC Offset/For Iterator Subsystem/If Action Subsystem1'
 * '<S483>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Heartbeat LED/Code generation'
 * '<S484>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Motor1 and Motor2 coupled/IIR Filter'
 * '<S485>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Motor1 and Motor2 coupled/Motor 1 - Speed control'
 * '<S486>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Motor1 and Motor2 coupled/Motor 2 - Torque control'
 * '<S487>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Motor1 and Motor2 coupled/IIR Filter/IIR Filter'
 * '<S488>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Motor1 and Motor2 coupled/IIR Filter/IIR Filter/Low-pass'
 * '<S489>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Motor1 and Motor2 coupled/IIR Filter/IIR Filter/Low-pass/IIR Low Pass Filter'
 * '<S490>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Motor1 and Motor2 coupled/Motor 1 - Speed control/PMSM Torque Input Exterior Discrete'
 * '<S491>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Motor1 and Motor2 coupled/Motor 1 - Speed control/PMSM Torque Input Exterior Discrete/PMSM Torque Input Core Discrete'
 * '<S492>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Motor1 and Motor2 coupled/Motor 1 - Speed control/PMSM Torque Input Exterior Discrete/PMSM Torque Input Core Discrete/Mechanical and Angle'
 * '<S493>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Motor1 and Motor2 coupled/Motor 1 - Speed control/PMSM Torque Input Exterior Discrete/PMSM Torque Input Core Discrete/Motor Units1'
 * '<S494>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Motor1 and Motor2 coupled/Motor 1 - Speed control/PMSM Torque Input Exterior Discrete/PMSM Torque Input Core Discrete/PMSM Electromagnetic'
 * '<S495>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Motor1 and Motor2 coupled/Motor 1 - Speed control/PMSM Torque Input Exterior Discrete/PMSM Torque Input Core Discrete/Mechanical and Angle/Int1'
 * '<S496>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Motor1 and Motor2 coupled/Motor 1 - Speed control/PMSM Torque Input Exterior Discrete/PMSM Torque Input Core Discrete/Mechanical and Angle/Int1/Compare To Constant'
 * '<S497>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Motor1 and Motor2 coupled/Motor 1 - Speed control/PMSM Torque Input Exterior Discrete/PMSM Torque Input Core Discrete/Mechanical and Angle/Int1/Compare To Constant1'
 * '<S498>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Motor1 and Motor2 coupled/Motor 1 - Speed control/PMSM Torque Input Exterior Discrete/PMSM Torque Input Core Discrete/Motor Units1/MechToElect'
 * '<S499>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Motor1 and Motor2 coupled/Motor 1 - Speed control/PMSM Torque Input Exterior Discrete/PMSM Torque Input Core Discrete/Motor Units1/Power Accounting Bus Creator'
 * '<S500>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Motor1 and Motor2 coupled/Motor 1 - Speed control/PMSM Torque Input Exterior Discrete/PMSM Torque Input Core Discrete/Motor Units1/Power Accounting Bus Creator/PwrNotTrnsfrd Input'
 * '<S501>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Motor1 and Motor2 coupled/Motor 1 - Speed control/PMSM Torque Input Exterior Discrete/PMSM Torque Input Core Discrete/Motor Units1/Power Accounting Bus Creator/PwrStored Input'
 * '<S502>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Motor1 and Motor2 coupled/Motor 1 - Speed control/PMSM Torque Input Exterior Discrete/PMSM Torque Input Core Discrete/Motor Units1/Power Accounting Bus Creator/PwrTrnsfrd Input'
 * '<S503>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Motor1 and Motor2 coupled/Motor 1 - Speed control/PMSM Torque Input Exterior Discrete/PMSM Torque Input Core Discrete/PMSM Electromagnetic/Clarke Transform'
 * '<S504>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Motor1 and Motor2 coupled/Motor 1 - Speed control/PMSM Torque Input Exterior Discrete/PMSM Torque Input Core Discrete/PMSM Electromagnetic/Inverse Clarke Transform'
 * '<S505>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Motor1 and Motor2 coupled/Motor 1 - Speed control/PMSM Torque Input Exterior Discrete/PMSM Torque Input Core Discrete/PMSM Electromagnetic/Inverse Park Transform'
 * '<S506>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Motor1 and Motor2 coupled/Motor 1 - Speed control/PMSM Torque Input Exterior Discrete/PMSM Torque Input Core Discrete/PMSM Electromagnetic/Machine Torque'
 * '<S507>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Motor1 and Motor2 coupled/Motor 1 - Speed control/PMSM Torque Input Exterior Discrete/PMSM Torque Input Core Discrete/PMSM Electromagnetic/PMSM Equivalent Circuit'
 * '<S508>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Motor1 and Motor2 coupled/Motor 1 - Speed control/PMSM Torque Input Exterior Discrete/PMSM Torque Input Core Discrete/PMSM Electromagnetic/Park Transform'
 * '<S509>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Motor1 and Motor2 coupled/Motor 1 - Speed control/PMSM Torque Input Exterior Discrete/PMSM Torque Input Core Discrete/PMSM Electromagnetic/Machine Torque/Subsystem'
 * '<S510>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Motor1 and Motor2 coupled/Motor 1 - Speed control/PMSM Torque Input Exterior Discrete/PMSM Torque Input Core Discrete/PMSM Electromagnetic/PMSM Equivalent Circuit/D Axis Stator Voltage'
 * '<S511>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Motor1 and Motor2 coupled/Motor 1 - Speed control/PMSM Torque Input Exterior Discrete/PMSM Torque Input Core Discrete/PMSM Electromagnetic/PMSM Equivalent Circuit/Q Axis Stator Voltage'
 * '<S512>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Motor1 and Motor2 coupled/Motor 1 - Speed control/PMSM Torque Input Exterior Discrete/PMSM Torque Input Core Discrete/PMSM Electromagnetic/PMSM Equivalent Circuit/D Axis Stator Voltage/Subsystem'
 * '<S513>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Motor1 and Motor2 coupled/Motor 1 - Speed control/PMSM Torque Input Exterior Discrete/PMSM Torque Input Core Discrete/PMSM Electromagnetic/PMSM Equivalent Circuit/D Axis Stator Voltage/Subsystem1'
 * '<S514>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Motor1 and Motor2 coupled/Motor 1 - Speed control/PMSM Torque Input Exterior Discrete/PMSM Torque Input Core Discrete/PMSM Electromagnetic/PMSM Equivalent Circuit/D Axis Stator Voltage/Subsystem2'
 * '<S515>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Motor1 and Motor2 coupled/Motor 1 - Speed control/PMSM Torque Input Exterior Discrete/PMSM Torque Input Core Discrete/PMSM Electromagnetic/PMSM Equivalent Circuit/Q Axis Stator Voltage/Subsystem'
 * '<S516>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Motor1 and Motor2 coupled/Motor 1 - Speed control/PMSM Torque Input Exterior Discrete/PMSM Torque Input Core Discrete/PMSM Electromagnetic/PMSM Equivalent Circuit/Q Axis Stator Voltage/Subsystem1'
 * '<S517>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Motor1 and Motor2 coupled/Motor 1 - Speed control/PMSM Torque Input Exterior Discrete/PMSM Torque Input Core Discrete/PMSM Electromagnetic/PMSM Equivalent Circuit/Q Axis Stator Voltage/Subsystem2'
 * '<S518>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Motor1 and Motor2 coupled/Motor 1 - Speed control/PMSM Torque Input Exterior Discrete/PMSM Torque Input Core Discrete/PMSM Electromagnetic/PMSM Equivalent Circuit/Q Axis Stator Voltage/Subsystem3'
 * '<S519>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Motor1 and Motor2 coupled/Motor 2 - Torque control/PMSM Speed Input Exterior Discrete'
 * '<S520>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Motor1 and Motor2 coupled/Motor 2 - Torque control/PMSM Speed Input Exterior Discrete/PMSM Speed Input Core Discrete'
 * '<S521>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Motor1 and Motor2 coupled/Motor 2 - Torque control/PMSM Speed Input Exterior Discrete/PMSM Speed Input Core Discrete/Mechanical and Angle'
 * '<S522>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Motor1 and Motor2 coupled/Motor 2 - Torque control/PMSM Speed Input Exterior Discrete/PMSM Speed Input Core Discrete/Motor Units1'
 * '<S523>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Motor1 and Motor2 coupled/Motor 2 - Torque control/PMSM Speed Input Exterior Discrete/PMSM Speed Input Core Discrete/PMSM Electromagnetic'
 * '<S524>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Motor1 and Motor2 coupled/Motor 2 - Torque control/PMSM Speed Input Exterior Discrete/PMSM Speed Input Core Discrete/Mechanical and Angle/Int'
 * '<S525>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Motor1 and Motor2 coupled/Motor 2 - Torque control/PMSM Speed Input Exterior Discrete/PMSM Speed Input Core Discrete/Mechanical and Angle/Int/Compare To Constant'
 * '<S526>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Motor1 and Motor2 coupled/Motor 2 - Torque control/PMSM Speed Input Exterior Discrete/PMSM Speed Input Core Discrete/Mechanical and Angle/Int/Compare To Constant1'
 * '<S527>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Motor1 and Motor2 coupled/Motor 2 - Torque control/PMSM Speed Input Exterior Discrete/PMSM Speed Input Core Discrete/Motor Units1/MechToElect'
 * '<S528>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Motor1 and Motor2 coupled/Motor 2 - Torque control/PMSM Speed Input Exterior Discrete/PMSM Speed Input Core Discrete/Motor Units1/Power Accounting Bus Creator'
 * '<S529>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Motor1 and Motor2 coupled/Motor 2 - Torque control/PMSM Speed Input Exterior Discrete/PMSM Speed Input Core Discrete/Motor Units1/Power Accounting Bus Creator/PwrNotTrnsfrd Input'
 * '<S530>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Motor1 and Motor2 coupled/Motor 2 - Torque control/PMSM Speed Input Exterior Discrete/PMSM Speed Input Core Discrete/Motor Units1/Power Accounting Bus Creator/PwrStored Input'
 * '<S531>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Motor1 and Motor2 coupled/Motor 2 - Torque control/PMSM Speed Input Exterior Discrete/PMSM Speed Input Core Discrete/Motor Units1/Power Accounting Bus Creator/PwrTrnsfrd Input'
 * '<S532>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Motor1 and Motor2 coupled/Motor 2 - Torque control/PMSM Speed Input Exterior Discrete/PMSM Speed Input Core Discrete/PMSM Electromagnetic/Clarke Transform'
 * '<S533>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Motor1 and Motor2 coupled/Motor 2 - Torque control/PMSM Speed Input Exterior Discrete/PMSM Speed Input Core Discrete/PMSM Electromagnetic/Inverse Clarke Transform'
 * '<S534>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Motor1 and Motor2 coupled/Motor 2 - Torque control/PMSM Speed Input Exterior Discrete/PMSM Speed Input Core Discrete/PMSM Electromagnetic/Inverse Park Transform'
 * '<S535>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Motor1 and Motor2 coupled/Motor 2 - Torque control/PMSM Speed Input Exterior Discrete/PMSM Speed Input Core Discrete/PMSM Electromagnetic/Machine Torque'
 * '<S536>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Motor1 and Motor2 coupled/Motor 2 - Torque control/PMSM Speed Input Exterior Discrete/PMSM Speed Input Core Discrete/PMSM Electromagnetic/PMSM Equivalent Circuit'
 * '<S537>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Motor1 and Motor2 coupled/Motor 2 - Torque control/PMSM Speed Input Exterior Discrete/PMSM Speed Input Core Discrete/PMSM Electromagnetic/Park Transform'
 * '<S538>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Motor1 and Motor2 coupled/Motor 2 - Torque control/PMSM Speed Input Exterior Discrete/PMSM Speed Input Core Discrete/PMSM Electromagnetic/Machine Torque/Subsystem'
 * '<S539>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Motor1 and Motor2 coupled/Motor 2 - Torque control/PMSM Speed Input Exterior Discrete/PMSM Speed Input Core Discrete/PMSM Electromagnetic/PMSM Equivalent Circuit/D Axis Stator Voltage'
 * '<S540>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Motor1 and Motor2 coupled/Motor 2 - Torque control/PMSM Speed Input Exterior Discrete/PMSM Speed Input Core Discrete/PMSM Electromagnetic/PMSM Equivalent Circuit/Q Axis Stator Voltage'
 * '<S541>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Motor1 and Motor2 coupled/Motor 2 - Torque control/PMSM Speed Input Exterior Discrete/PMSM Speed Input Core Discrete/PMSM Electromagnetic/PMSM Equivalent Circuit/D Axis Stator Voltage/Subsystem'
 * '<S542>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Motor1 and Motor2 coupled/Motor 2 - Torque control/PMSM Speed Input Exterior Discrete/PMSM Speed Input Core Discrete/PMSM Electromagnetic/PMSM Equivalent Circuit/D Axis Stator Voltage/Subsystem1'
 * '<S543>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Motor1 and Motor2 coupled/Motor 2 - Torque control/PMSM Speed Input Exterior Discrete/PMSM Speed Input Core Discrete/PMSM Electromagnetic/PMSM Equivalent Circuit/D Axis Stator Voltage/Subsystem2'
 * '<S544>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Motor1 and Motor2 coupled/Motor 2 - Torque control/PMSM Speed Input Exterior Discrete/PMSM Speed Input Core Discrete/PMSM Electromagnetic/PMSM Equivalent Circuit/Q Axis Stator Voltage/Subsystem'
 * '<S545>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Motor1 and Motor2 coupled/Motor 2 - Torque control/PMSM Speed Input Exterior Discrete/PMSM Speed Input Core Discrete/PMSM Electromagnetic/PMSM Equivalent Circuit/Q Axis Stator Voltage/Subsystem1'
 * '<S546>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Motor1 and Motor2 coupled/Motor 2 - Torque control/PMSM Speed Input Exterior Discrete/PMSM Speed Input Core Discrete/PMSM Electromagnetic/PMSM Equivalent Circuit/Q Axis Stator Voltage/Subsystem2'
 * '<S547>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Motor1 and Motor2 coupled/Motor 2 - Torque control/PMSM Speed Input Exterior Discrete/PMSM Speed Input Core Discrete/PMSM Electromagnetic/PMSM Equivalent Circuit/Q Axis Stator Voltage/Subsystem3'
 * '<S548>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Serial Receive/Parse SCI Rx'
 * '<S549>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Serial Receive/Serial Receive'
 * '<S550>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Serial Receive/Parse SCI Rx/Data_Conditioning_Rx'
 * '<S551>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Serial Receive/Parse SCI Rx/unParse'
 * '<S552>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Serial Receive/Parse SCI Rx/Data_Conditioning_Rx/Data_Type_Float'
 * '<S553>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Serial Receive/Serial Receive/Serial Rx'
 * '<S554>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Serial Receive/Serial Receive/Serial Rx/Data_Type_Float'
 * '<S555>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Speed Control/PI_Controller_Speed'
 * '<S556>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Speed Control/Rate Limiter for FO'
 * '<S557>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Speed Control/Rate Limiter for SMO'
 * '<S558>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Speed Control/Speed_Ref_Selector'
 * '<S559>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset'
 * '<S560>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Speed Control/PI_Controller_Speed/PI_Controller_Speed'
 * '<S561>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Speed Control/PI_Controller_Speed/Zero_Cancellation'
 * '<S562>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Anti-windup'
 * '<S563>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/D Gain'
 * '<S564>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/External Derivative'
 * '<S565>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Filter'
