giovannimasi/MATLAB_Simulink_tirocinio_2025/Examples/R2024b/c2b/DualMotorDynoUsingC2000ProcessorsExample(old)/mcb_pmsm_foc_sensorless_dyno_f28379d_ert_rtw/mcb_pmsm_foc_sensorless_dyno_f28379d.h
 * '<S566>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Filter ICs'
 * '<S567>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/I Gain'
 * '<S568>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Ideal P Gain'
 * '<S569>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Ideal P Gain Fdbk'
 * '<S570>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Integrator'
 * '<S571>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Integrator ICs'
 * '<S572>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/N Copy'
 * '<S573>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/N Gain'
 * '<S574>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/P Copy'
 * '<S575>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Parallel P Gain'
 * '<S576>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Reset Signal'
 * '<S577>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Saturation'
 * '<S578>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Saturation Fdbk'
 * '<S579>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Sum'
 * '<S580>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Sum Fdbk'
 * '<S581>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Tracking Mode'
 * '<S582>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Tracking Mode Sum'
 * '<S583>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Tsamp - Integral'
 * '<S584>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Tsamp - Ngain'
 * '<S585>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/postSat Signal'
 * '<S586>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/preInt Signal'
 * '<S587>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/preSat Signal'
 * '<S588>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Anti-windup/Disc. Clamping Parallel'
 * '<S589>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Anti-windup/Disc. Clamping Parallel/Dead Zone'
 * '<S590>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Anti-windup/Disc. Clamping Parallel/Dead Zone/Enabled'
 * '<S591>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/D Gain/Disabled'
 * '<S592>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/External Derivative/Disabled'
 * '<S593>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Filter/Disabled'
 * '<S594>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Filter ICs/Disabled'
 * '<S595>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/I Gain/External Parameters'
 * '<S596>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Ideal P Gain/Passthrough'
 * '<S597>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Ideal P Gain Fdbk/Disabled'
 * '<S598>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Integrator/Discrete'
 * '<S599>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Integrator ICs/External IC'
 * '<S600>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/N Copy/Disabled wSignal Specification'
 * '<S601>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/N Gain/Disabled'
 * '<S602>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/P Copy/Disabled'
 * '<S603>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Parallel P Gain/External Parameters'
 * '<S604>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Reset Signal/External Reset'
 * '<S605>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Saturation/Enabled'
 * '<S606>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Saturation Fdbk/Disabled'
 * '<S607>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Sum/Sum_PI'
 * '<S608>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Sum Fdbk/Disabled'
 * '<S609>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Tracking Mode/Disabled'
 * '<S610>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Tracking Mode Sum/Passthrough'
 * '<S611>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Tsamp - Integral/TsSignalSpecification'
 * '<S612>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Tsamp - Ngain/Passthrough'
 * '<S613>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/postSat Signal/Forward_Path'
 * '<S614>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/preInt Signal/Internal PreInt'
 * '<S615>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/preSat Signal/Forward_Path'
 * '<S616>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Speed Control/PI_Controller_Speed/Zero_Cancellation/IIR Filter'
 * '<S617>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Speed Control/PI_Controller_Speed/Zero_Cancellation/IIR Filter/Low-pass'
 * '<S618>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Speed Control/PI_Controller_Speed/Zero_Cancellation/IIR Filter/Low-pass/IIR Low Pass Filter'
 * '<S619>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Torque Demand/IIR Filter'
 * '<S620>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Torque Demand/IIR Filter/IIR Filter'
 * '<S621>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Torque Demand/IIR Filter/IIR Filter/Low-pass'
 * '<S622>' : 'mcb_pmsm_foc_sensorless_dyno_f28379d/Torque Demand/IIR Filter/IIR Filter/Low-pass/IIR Low Pass Filter'
 */
#endif                             /* mcb_pmsm_foc_sensorless_dyno_f28379d_h_ */

/*
 * File trailer for generated code.
 *
 * [EOF]
 */
